{"content":"<div><div class=\"content\">\n<p>Writing I/O- and CPU-bound asynchronous code is straightforward using the .NET Task-based async model. The model is exposed by the <code>Task</code> and <code>Task&lt;T&gt;</code> types and the <code>async</code> and <code>await</code> language keywords. This article explains how to use .NET async and provides insight into the async framework used under the covers.</p>\n<h2 id=\"task-and-tasklttgt\">Task and Task&lt;T&gt;</h2>\n<p>Tasks are constructs used to implement what is known as the <a href=\"https://en.wikipedia.org/wiki/Futures_and_promises\" data-linktype=\"external\">Promise Model of Concurrency</a>.  In short, they offer you a &quot;promise&quot; that work will be completed at a later point, letting you coordinate with the promise with a clean API.</p>\n<ul>\n<li><code>Task</code> represents a single operation which does not return a value.</li>\n<li><code>Task&lt;T&gt;</code> represents a single operation which returns a value of type <code>T</code>.</li>\n</ul>\n<p>It’s important to reason about tasks as abstractions of work happening asynchronously, and <em>not</em> an abstraction over threading. By default, tasks execute on the current thread and delegate work to the Operating System, as appropriate. Optionally, tasks can be be explicitly requested to run on a separate thread via the <code>Task.Run</code> API.</p>\n<p>Tasks expose an API protocol for monitoring, waiting upon and accessing the result value (in the case of <code>Task&lt;T&gt;</code>) of a task. Language integration, with the <code>await</code> keyword, provides a higher-level abstraction for using tasks. </p>\n<p>Using <code>await</code> allows your application or service to perform useful work while a task is running by yielding control to its caller until the task is done. Your code does not need to rely on callbacks or events to continue execution after the task has been completed. The language and task API integration does that for you. If you’re using <code>Task&lt;T&gt;</code>, the <code>await</code> keyword will additionally “unwrap” the value returned when the Task is complete.  The details of how this works are explained further below.</p>\n<p>You can learn more about tasks and the different ways to interact with them in the <a href=\"https://msdn.microsoft.com/library/hh873175.aspx\" data-linktype=\"external\">Task-based Asynchronous Pattern (TAP) Article</a>.</p>\n<h2 id=\"deeper-dive-into-tasks-for-an-io-bound-operation\">Deeper Dive into Tasks for an I/O-Bound Operation</h2>\n<p>The following section describes a 10,000 foot view of what happens with a typical async I/O call. Let&#39;s start with a couple examples.</p>\n<p>The first example calls an async method and returns an active task, likely yet to complete.</p>\n<pre class=\"loading\"><code class=\"lang-csharp\">public Task&lt;string&gt; GetHtmlAsync()\n{\n     // Execution is synchronous here\n    var client = new HttpClient();\n\n    return client.GetStringAsync(&quot;http://www.dotnetfoundation.org&quot;);\n}\n</code></pre><p>The second example adds the use of he <code>async</code> and <code>await</code> keywords to operate on the task.</p>\n<pre class=\"loading\"><code class=\"lang-csharp\">public async Task&lt;string&gt; GetFirstCharactersCountAsync(string url, int count)\n{\n    // Execution is synchronous here\n    var client = new HttpClient();\n\n    // Execution of GetFirstCharactersCountAsync() is yielded to the caller here\n    // GetStringAsync returns a Task&lt;string&gt;, which is *awaited*\n    var page = await client.GetStringAsync(&quot;http://www.dotnetfoundation.org&quot;);\n\n    // Execution resumes when the client.GetStringAsync task completes,\n    // becoming synchronous again.\n\n    if (count &gt; page.Length)\n    {\n        return page;\n    }\n    else\n    {\n        return page.Substring(0, count);\n    }\n}\n</code></pre><p>The call to <code>GetStringAsync()</code> calls through lower-level .NET libraries (perhaps calling other async methods) until it reaches a P/Invoke interop call into a native networking library. The native library may subsequently call into a System API call (such as <code>write()</code> to a socket on Linux). A task object will be created at the native/managed boundary, possibly using <a class=\"xref\" href=\"../../api/system.threading.tasks.taskcompletionsource-1#System_Threading_Tasks_TaskCompletionSource_1_SetResult__0_\" data-linktype=\"relative-path\">TaskCompletionSource</a>. The task object will be passed up through the layers, possibly operated on or directly returned, eventually returned to the initial caller. </p>\n<p>In the second example above, a <code>Task&lt;T&gt;</code> object will be returned from <code>GetStringAsync</code>. The use of the <code>await</code> keyword causes the method to return a newly created task object. Control returns to the caller from this location in the <code>GetFirstCharactersCountAsync</code> method. The methods and properties of the <a class=\"xref\" href=\"../../api/system.threading.tasks.task-1\" data-linktype=\"relative-path\">Task&lt;T&gt;</a> object enable callers to monitor the progress of the task, which will complete when the remaining code in GetFirstCharactersCountAsync has executed.</p>\n<p>After the System API call, the request is now in kernel space, making its way to the networking subsystem of the OS (such as <code>/net</code> in the Linux Kernel).  Here the OS will handle the networking request <em>asynchronously</em>.  Details may be different depending on the OS used (the device driver call may be scheduled as a signal sent back to the runtime, or a device driver call may be made and <em>then</em> a signal sent back), but eventually the runtime will be informed that the networking request is in progress.  At this time, the work for the device driver will either be scheduled, in-progress, or already finished (the request is already out &quot;over the wire&quot;) - but because this is all happening asynchronously, the device driver is able to immediately handle something else!</p>\n<p>For example, in Windows an OS thread makes a call to the network device driver and asks it to perform the networking operation via an Interrupt Request Packet (IRP) which represents the operation.  The device driver receives the IRP, makes the call to the network, marks the IRP as &quot;pending&quot;, and returns back to the OS.  Because the OS thread now knows that the IRP is &quot;pending&quot;, it doesn&#39;t have any more work to do for this job and &quot;returns&quot; back so that it can be used to perform other work.</p>\n<p>When the request is fulfilled and data comes back through the device driver, it notifies the CPU of new data received via an interrupt.  How this interrupt gets handled will vary depending on the OS, but eventually the data will be passed through the OS until it reaches a system interop call (for example, in Linux an interrupt handler will schedule the bottom half of the IRQ to pass the data up through the OS asynchronously).  Note that this <em>also</em> happens asynchronously!  The result is queued up until the next available thread is able execute the async method and &quot;unwrap&quot; the result of the completed task.</p>\n<p>Throughout this entire process, a key takeaway is that <strong>no thread is dedicated to running the task</strong>.  Although work is executed in some context (that is, the OS does have to pass data to a device driver and respond to an interrupt), there is no thread dedicated to <em>waiting</em> for data from the request to come back.  This allows the system to handle a much larger volume of work rather than waiting for some I/O call to finish.</p>\n<p>Although the above may seem like a lot of work to be done, when measured in terms of wall clock time, it’s miniscule compared to the time it takes to do the actual I/O work. Although not at all precise, a potential timeline for such a call would look like this:</p>\n<p>0-1————————————————————————————————————————————————–2-3</p>\n<ul>\n<li>Time spent from points <code>0</code> to <code>1</code> is everything up until an async method yields control to its caller.</li>\n<li>Time spent from points <code>1</code> to <code>2</code> is the time spent on I/O, with no CPU cost.</li>\n<li>Finally, time spent from points <code>2</code> to <code>3</code> is passing control back (and potentially a value) to the async method, at which point it is executing again.</li>\n</ul>\n<h3 id=\"what-does-this-mean-for-a-server-scenario\">What does this mean for a server scenario?</h3>\n<p>This model works well with a typical server scenario workload.  Because there are no threads dedicated to blocking on unfinished tasks, the server threadpool can service a much higher volume of web requests.</p>\n<p>Consider two servers: one that runs async code, and one that does not.  For the purpose of this example, each server only has 5 threads available to service requests.  Note that these numbers are imaginarily small and serve only in a demonstrative context.</p>\n<p>Assume both servers receive 6 concurrent requests. Each request performs an I/O operation.  The server <em>without</em> async code has to queue up the 6th request until one of the 5 threads have finished the I/O-bound work and written a response. At the point that the 20th request comes in, the server might start to slow down, because the queue is getting too long.</p>\n<p>The server <em>with</em> async code running on it still queues up the 6th request, but because it uses <code>async</code> and <code>await</code>, each of its threads are freed up when the I/O-bound work starts, rather than when it finishes.  By the time the 20th request comes in, the queue for incoming requests will be far smaller (if it has anything in it at all), and the server won&#39;t slow down.</p>\n<p>Although this is a contrived example, it works in a very similar fashion in the real world.  In fact, you can expect a server to be able to handle an order of magnitude more requests using <code>async</code> and <code>await</code> than if it were dedicating a thread for each request it receives.</p>\n<h3 id=\"what-does-this-mean-for-client-scenario\">What does this mean for client scenario?</h3>\n<p>The biggest gain for using <code>async</code> and <code>await</code> for a client app is an increase in responsiveness.  Although you can make an app responsive by spawning threads manually, the act of spawning a thread is an expensive operation relative to just using <code>async</code> and <code>await</code>.  Especially for something like a mobile game, impacting the UI thread as little as possible where I/O is concerned is crucial.</p>\n<p>More importantly, because I/O-bound work spends virtually no time on the CPU, dedicating an entire CPU thread to perform barely any useful work would be a poor use of resources.</p>\n<p>Additionally, dispatching work to the UI thread (such as updating a UI) is very simple with <code>async</code> methods, and does not require extra work (such as calling a thread-safe delegate).</p>\n<h2 id=\"deeper-dive-into-task-and-taskt-for-a-cpu-bound-operation\">Deeper Dive into Task and Task<t> for a CPU-Bound Operation</t></h2>\n<p>CPU-bound <code>async</code> code is a bit different than I/O-bound <code>async</code> code.  Because the work is done on the CPU, there&#39;s no way to get around dedicating a thread to the computation.  The use of <code>async</code> and <code>await</code> provides you with a clean way to interact with a background thread and keep the caller of the async method responsive.  Note that this does not provide any protection for shared data.  If you are using shared data, you will still need to apply an appropriate synchronization strategy.</p>\n<p>Here&#39;s a 10,000 foot view of a CPU-bound async call:</p>\n<pre class=\"loading\"><code class=\"lang-csharp\">public async Task&lt;int&gt; CalculateResult(InputData data)\n{\n    // This queues up the work on the threadpool.\n    var expensiveResultTask = Task.Run(() =&gt; DoExpensiveCalculation(data));\n\n    // Note that at this point, you can do some other work concurrently,\n    // as CalculateResult() is still executing!\n\n    // Execution of CalculateResult is yielded here!\n    var result = await expensiveResultTask;\n\n    return result;\n}\n</code></pre><p><code>CalculateResult()</code> executes on the thread it was called on.  When it calls <code>Task.Run</code>, it queues the expensive CPU-bound operation, <code>DoExpensiveCalculation()</code>, on the thread pool and receives a <code>Task&lt;int&gt;</code> handle.  <code>DoExpensiveCalculation()</code> is eventually run concurrently on the next available thread, likely on another CPU core.  It&#39;s possible to do concurrent work while <code>DoExpensiveCalculation()</code> is busy on another thread, because the thread which called <code>CalculateResult()</code> is still executing.</p>\n<p>Once <code>await</code> is encountered, the execution of <code>CalculateResult()</code> is yielded to its caller, allowing other work to be done with the current thread while <code>DoExpensiveCalculation()</code> is churning out a result.  Once it has finished, the result is queued up to run on the main thread.  Eventually, the main thread will return to executing <code>CalculateResult()</code>, at which point it will have the result of <code>DoExpensiveCalculation()</code>.</p>\n<h3 id=\"why-does-async-help-here\">Why does async help here?</h3>\n<p><code>async</code> and <code>await</code> are the best practice managing CPU-bound work when you need responsiveness. There are multiple patterns for using async with CPU-bound work. It&#39;s important to note that there is a small cost to using async and it&#39;s not recommended for tight loops.  It&#39;s up to you to determine how you write your code around this new capability.</p>\n</div></div>","outputRootRelativePath":"../../","pageMetadata":"<meta name=\"author\" content=\"cartermp\">\r\n<meta name=\"ms.author\" content=\"wiwagn\">\r\n<meta name=\"manager\" content=\"wpickett\">\r\n<meta name=\"breadcrumb_path\" content=\"toc2.json\">\r\n<meta name=\"ms.devlang\" content=\"dotnet\">\r\n<meta name=\"ms.assetid\" content=\"1e38f9d9-8f84-46ee-a15f-199aec4f2e34\">\r\n<meta name=\"description\" content=\"In-depth explanation of how asynchronous code works in .NET\">\r\n<meta name=\"keywords\" content=\".NET, .NET Core, .NET Standard\">\r\n<meta name=\"ms.topic\" content=\"article\">\r\n<meta name=\"ms.date\" content=\"06/20/2016\">\r\n<meta name=\"ms.technology\" content=\"dotnet-standard\">\r\n<meta name=\"ms.prod\" content=\".net\">\r\n<meta name=\"search.ms_sitename\" content=\"Docs\">\r\n<meta name=\"search.ms_docsetname\" content=\"docs-internal\">\r\n<meta name=\"version\" content=\"0\">\r\n<meta name=\"locale\" content=\"en-us\">\r\n<meta name=\"site_name\" content=\"Docs\">\r\n<meta name=\"search.ms_product\" content=\"MSDN\">\r\n<meta name=\"depot_name\" content=\"MSDN.docs-internal\">\r\n<meta name=\"updated_at\" content=\"2017-03-15 06:14 PM\">\r\n<meta name=\"gitcommit\" content=\"https://github.com/dotnet/docs-internal/blob/d3fdf46c825d04d29da3e3fafac667eacf01e02e/docs/standard/async-in-depth.md\">\r\n<meta name=\"original_content_git_url\" content=\"https://github.com/dotnet/docs-internal/blob/master/docs/standard/async-in-depth.md\">\r\n<meta name=\"document_id\" content=\"361cc48d-c51c-67a7-636a-431d087d356e\">\r\n<meta name=\"pagetype\" content=\"Conceptual\">\r\n<meta name=\"toc_rel\" content=\"../toc2.json\">\r\n","rawMetadata":{"author":"cartermp","ms.author":"wiwagn","manager":"wpickett","breadcrumb_path":"/dotnet-internal/toc.json","title":"Async in depth | Microsoft Docs","ms.devlang":"dotnet","ms.assetid":"1e38f9d9-8f84-46ee-a15f-199aec4f2e34","description":"In-depth explanation of how asynchronous code works in .NET","keywords":".NET, .NET Core, .NET Standard","ms.topic":"article","ms.date":"06/20/2016","ms.technology":"dotnet-standard","ms.prod":".net","search.ms_sitename":"Docs","search.ms_docsetname":"docs-internal","version":0,"_op_canonicalUrlPrefix":"https://docs.microsoft.com/en-us/dotnet-internal/","locale":"en-us","site_name":"Docs","search.ms_product":"MSDN","_op_openToPublicContributors":false,"depot_name":"MSDN.docs-internal","_op_gitCommitHistory":[{"author_name":"tompratt-AQ","author_email":"v-thprat@microsoft.com","committer_name":"Phillip Carter","comitter_email":"phillip.carter@outlook.com","message":"Fixed instances of e.g. and i.e. (#1701)","commit_sha":"d3fdf46c825d04d29da3e3fafac667eacf01e02e","commit_date":"2017-03-10 09:04:31 -0800"},{"author_name":"Maira Wenzel","author_email":"mairaw@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"Metadata updates (#1313)","commit_sha":"90fe68f7f3c4b46502b5d3770b1a2d57c6af748a","commit_date":"2016-12-09 12:40:41 -0800"},{"author_name":"Maira Wenzel","author_email":"mairaw@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"fixed absolute and msdn links (#1001)","commit_sha":"de0dab146fc811e895dc32f98f877db5e757f82b","commit_date":"2016-09-06 10:59:39 -0700"},{"author_name":"Maira Wenzel","author_email":"mairaw@microsoft.com","committer_name":"Bill Wagner","comitter_email":"wiwagn@microsoft.com","message":"Fixed typos and other small things (#883)","commit_sha":"bb15293c569fa92f1acf6315c5fe7f2cd9cb6f68","commit_date":"2016-08-08 21:27:46 -0400"},{"author_name":"Maira Wenzel","author_email":"mairaw@users.noreply.github.com","committer_name":"Rich Lander","comitter_email":"rlander@microsoft.com","message":"fixed generic links (#658)","commit_sha":"e07788926a995b41571be276379ad9285747951d","commit_date":"2016-06-26 16:20:19 -0700"},{"author_name":"Tom Dykstra","author_email":"tdykstra@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"add metadata (#636)","commit_sha":"5d94f5eccb3a1ea294f976f49d3e4df0b0b77dbb","commit_date":"2016-06-25 14:02:15 -0700"},{"author_name":"Tom Dykstra","author_email":"tdykstra@microsoft.com","committer_name":"Rich Lander","comitter_email":"rlander@microsoft.com","message":"move async docs (#631)","commit_sha":"9abc4879533074e6830a7343123b139e912d239b","commit_date":"2016-06-25 11:46:23 -0700"}],"updated_at":"2017-03-15 06:14 PM","_op_gitContributorInformation":{"author":{"profile_url":"https://github.com/cartermp","display_name":"Phillip Carter","id":"6309070"},"contributors":[{"profile_url":"https://github.com/cartermp","display_name":"Phillip Carter"},{"profile_url":"https://github.com/tompratt-AQ","display_name":"tompratt-AQ","id":"26311438"},{"profile_url":"https://github.com/mairaw","display_name":"Maira Wenzel","id":"12971179"},{"profile_url":"https://github.com/tdykstra","display_name":"Tom Dykstra","id":"1569635"}],"update_at":"3/15/2017"},"gitcommit":"https://github.com/dotnet/docs-internal/blob/d3fdf46c825d04d29da3e3fafac667eacf01e02e/docs/standard/async-in-depth.md","original_content_git_url":"https://github.com/dotnet/docs-internal/blob/master/docs/standard/async-in-depth.md","open_to_public_contributors":false,"content_git_url":"https://github.com/dotnet/docs/blob/master/docs/standard/async-in-depth.md","document_id":"361cc48d-c51c-67a7-636a-431d087d356e","layout":"Conceptual","pagetype":"Conceptual","canonical_url":"https://docs.microsoft.com/en-us/dotnet-all/articles/standard/async-in-depth","toc_asset_id":"articles/toc.json","toc_rel":"../toc.json","_op_ogTitle":"Async in depth","_op_displayDate":"2016-6-20","_op_displayDate_source":"2016-06-20T00:00:00Z","_op_wordCount":1885,"_op_rawTitle":"<h1 id=\"async-in-depth\" sourcefile=\"docs/standard/async-in-depth.md\" sourcestartlinenumber=\"15\" sourceendlinenumber=\"15\">Async in depth</h1>","_op_searchScope":[".NET"],"_op_canonicalUrl":"https://docs.microsoft.com/en-us/dotnet-all/articles/standard/async-in-depth","fileRelativePath":"articles/standard/async-in-depth.html"},"themesRelativePathToOutputRoot":"_themes/"}