{"content":"<div><div class=\"content\">\n<p>An <em>object</em> is a combination of code and data that can be treated as a unit. An object can be a piece of an application, like a control or a form. An entire application can also be an object.  </p>\n<p> When you create an application in Visual Basic, you constantly work with objects. You can use objects provided by Visual Basic, such as controls, forms, and data access objects. You can also use objects from other applications within your Visual Basic application. You can even create your own objects and define additional properties and methods for them. Objects act like prefabricated building blocks for programs — they let you write a piece of code once and reuse it over and over.  </p>\n<p> This topic discusses objects in detail.  </p>\n<h2 id=\"objects-and-classes\">Objects and Classes</h2>\n<p> Each object in Visual Basic is defined by a <em>class</em>. A class describes the variables, properties, procedures, and events of an object. Objects are instances of classes; you can create as many objects you need once you have defined a class.  </p>\n<p> To understand the relationship between an object and its class, think of cookie cutters and cookies. The cookie cutter is the class. It defines the characteristics of each cookie, for example size and shape. The class is used to create objects. The objects are the cookies.  </p>\n<p> You must create an object before you can access its members.  </p>\n<h4 id=\"to-create-an-object-from-a-class\">To create an object from a class</h4>\n<ol>\n<li><p>Determine from which class you want to create an object.  </p>\n</li>\n<li><p>Write a <a href=\"../../../language-reference/statements/dim-statement\" data-linktype=\"relative-path\">Dim Statement</a> to create a variable to which you can assign a class instance. The variable should be of the type of the desired class.  </p>\n<pre class=\"loading\"><code>\nDim nextCustomer As customer  \n</code></pre></li>\n<li><p>Add the <a href=\"../../../language-reference/operators/new-operator\" data-linktype=\"relative-path\">New Operator</a> keyword to initialize the variable to a new instance of the class.  </p>\n<pre class=\"loading\"><code>Dim nextCustomer As New customer  \n</code></pre></li>\n<li><p>You can now access the members of the class through the object variable.  </p>\n<pre class=\"loading\"><code>\nnextCustomer.accountNumber = lastAccountNumber + 1  \n</code></pre></li>\n</ol>\n<div class=\"NOTE\"><h5>Note</h5><p> Whenever possible, you should declare the variable to be of the class type you intend to assign to it. This is called <em>early binding</em>. If you do not know the class type at compile time, you can invoke <em>late binding</em> by declaring the variable to be of the <a href=\"../../../language-reference/data-types/object-data-type\" data-linktype=\"relative-path\">Object Data Type</a>. However, late binding can make performance slower and limit access to the run-time object&#39;s members. For more information, see <a href=\"../variables/object-variable-declaration\" data-linktype=\"relative-path\">Object Variable Declaration</a>.  </p>\n</div>\n<h3 id=\"multiple-instances\">Multiple Instances</h3>\n<p> Objects newly created from a class are often identical to each other. Once they exist as individual objects, however, their variables and properties can be changed independently of the other instances. For example, if you add three check boxes to a form, each check box object is an instance of the <a class=\"xref\" href=\"../../../../../api/system.windows.forms.checkbox\" data-linktype=\"relative-path\">CheckBox</a> class. The individual <a class=\"xref\" href=\"../../../../../api/system.windows.forms.checkbox\" data-linktype=\"relative-path\">CheckBox</a> objects share a common set of characteristics and capabilities (properties, variables, procedures, and events) defined by the class. However, each has its own name, can be separately enabled and disabled, and can be placed in a different location on the form.  </p>\n<h2 id=\"object-members\">Object Members</h2>\n<p> An object is an element of an application, representing an <em>instance</em> of a class. Fields, properties, methods, and events are the building blocks of objects and constitute their <em>members</em>.  </p>\n<h3 id=\"member-access\">Member Access</h3>\n<p> You access a member of an object by specifying, in order, the name of the object variable, a period (<code>.</code>), and the name of the member. The following example sets the <a class=\"xref\" href=\"../../../../../api/system.windows.forms.control#System_Windows_Forms_Control_Text_\" data-linktype=\"relative-path\">Text</a> property of a <a class=\"xref\" href=\"../../../../../api/system.windows.forms.label\" data-linktype=\"relative-path\">Label</a> object.  </p>\n<pre class=\"loading\"><code>warningLabel.Text = &quot;Data not saved&quot;  \n</code></pre><h4 id=\"intellisense-listing-of-members\">IntelliSense Listing of Members</h4>\n<p> IntelliSense lists members of a class when you invoke its List Members option, for example when you type a period (<code>.</code>) as a member-access operator. If you type the period following the name of a variable declared as an instance of that class, IntelliSense lists all the instance members and none of the shared members. If you type the period following the class name itself, IntelliSense lists all the shared members and none of the instance members. For more information, see <a href=\"https://docs.microsoft.com/visualstudio/ide/using-intellisense\" data-linktype=\"external\">Using IntelliSense</a>.  </p>\n<h3 id=\"fields-and-properties\">Fields and Properties</h3>\n<p> <em>Fields</em> and <em>properties</em> represent information stored in an object. You retrieve and set their values with assignment statements the same way you retrieve and set local variables in a procedure. The following example retrieves the <a class=\"xref\" href=\"../../../../../api/system.windows.forms.control#System_Windows_Forms_Control_Width_\" data-linktype=\"relative-path\">Width</a> property and sets the <a class=\"xref\" href=\"../../../../../api/system.windows.forms.control#System_Windows_Forms_Control_ForeColor_\" data-linktype=\"relative-path\">ForeColor</a> property of a <a class=\"xref\" href=\"../../../../../api/system.windows.forms.label\" data-linktype=\"relative-path\">Label</a> object.  </p>\n<pre class=\"loading\"><code>Dim warningWidth As Integer = warningLabel.Width  \nwarningLabel.ForeColor = System.Drawing.Color.Red  \n</code></pre><p> Note that a field is also called a <em>member variable</em>.  </p>\n<p> Use property procedures when:  </p>\n<ul>\n<li><p>You need to control when and how a value is set or retrieved.  </p>\n</li>\n<li><p>The property has a well-defined set of values that need to be validated.  </p>\n</li>\n<li><p>Setting the value causes some perceptible change in the object&#39;s state, such as an <code>IsVisible</code> property.  </p>\n</li>\n<li><p>Setting the property causes changes to other internal variables or to the values of other properties.  </p>\n</li>\n<li><p>A set of steps must be performed before the property can be set or retrieved.  </p>\n</li>\n</ul>\n<p> Use fields when:  </p>\n<ul>\n<li><p>The value is of a self-validating type. For example, an error or automatic data conversion occurs if a value other than <code>True</code> or <code>False</code> is assigned to a <code>Boolean</code> variable.  </p>\n</li>\n<li><p>Any value in the range supported by the data type is valid. This is true of many properties of type <code>Single</code> or <code>Double</code>.  </p>\n</li>\n<li><p>The property is a <code>String</code> data type, and there is no constraint on the size or value of the string.  </p>\n</li>\n<li><p>For more information, see <a href=\"../procedures/property-procedures\" data-linktype=\"relative-path\">Property Procedures</a>.  </p>\n</li>\n</ul>\n<h3 id=\"methods\">Methods</h3>\n<p> A <em>method</em> is an action that an object can perform. For example, <a class=\"xref\" href=\"../../../../../api/system.windows.forms.combobox.objectcollection#System_Windows_Forms_ComboBox_ObjectCollection_Add_\" data-linktype=\"relative-path\">Add</a> is a method of the <a class=\"xref\" href=\"../../../../../api/system.windows.forms.combobox\" data-linktype=\"relative-path\">ComboBox</a> object that adds a new entry to a combo box.  </p>\n<p> The following example demonstrates the <a class=\"xref\" href=\"../../../../../api/system.windows.forms.timer#System_Windows_Forms_Timer_Start_\" data-linktype=\"relative-path\">Start</a> method of a <a class=\"xref\" href=\"../../../../../api/system.windows.forms.timer\" data-linktype=\"relative-path\">Timer</a> object.  </p>\n<pre class=\"loading\"><code>Dim safetyTimer As New System.Windows.Forms.Timer  \nsafetyTimer.Start()  \n</code></pre><p> Note that a method is simply a <em>procedure</em> that is exposed by an object.  </p>\n<p> For more information, see <a href=\"../procedures/index\" data-linktype=\"relative-path\">Procedures</a>.  </p>\n<h3 id=\"events\">Events</h3>\n<p> An event is an action recognized by an object, such as clicking the mouse or pressing a key, and for which you can write code to respond. Events can occur as a result of a user action or program code, or they can be caused by the system. Code that signals an event is said to <em>raise</em> the event, and code that responds to it is said to <em>handle</em> it.  </p>\n<p> You can also develop your own custom events to be raised by your objects and handled by other objects. For more information, see <a href=\"../events/index\" data-linktype=\"relative-path\">Events</a>.  </p>\n<h3 id=\"instance-members-and-shared-members\">Instance Members and Shared Members</h3>\n<p> When you create an object from a class, the result is an instance of that class. Members that are not declared with the <a href=\"../../../language-reference/modifiers/shared\" data-linktype=\"relative-path\">Shared</a> keyword are <em>instance members</em>, which belong strictly to that particular instance. An instance member in one instance is independent of the same member in another instance of the same class. An instance member variable, for example, can have different values in different instances.  </p>\n<p> Members declared with the <code>Shared</code> keyword are <em>shared members</em>, which belong to the class as a whole and not to any particular instance. A shared member exists only once, no matter how many instances of its class you create, or even if you create no instances. A shared member variable, for example, has only one value, which is available to all code that can access the class.  </p>\n<h4 id=\"accessing-nonshared-members\">Accessing Nonshared Members</h4>\n<h6 id=\"to-access-a-nonshared-member-of-an-object\">To access a nonshared member of an object</h6>\n<ol>\n<li><p>Make sure the object has been created from its class and assigned to an object variable.  </p>\n<pre class=\"loading\"><code>Dim secondForm As New System.Windows.Forms.Form  \n</code></pre></li>\n<li><p>In the statement that accesses the member, follow the object variable name with the <em>member-access operator</em> (<code>.</code>) and then the member name.  </p>\n<pre class=\"loading\"><code>secondForm.Show()  \n</code></pre></li>\n</ol>\n<h4 id=\"accessing-shared-members\">Accessing Shared Members</h4>\n<h6 id=\"to-access-a-shared-member-of-an-object\">To access a shared member of an object</h6>\n<ul>\n<li><p>Follow the class name with the <em>member-access operator</em> (<code>.</code>) and then the member name. You should always access a <code>Shared</code> member of the object directly through the class name.  </p>\n<pre class=\"loading\"><code>MsgBox(&quot;This computer is called &quot; &amp; Environment.MachineName)  \n</code></pre></li>\n<li><p>If you have already created an object from the class, you can alternatively access a <code>Shared</code> member through the object&#39;s variable.  </p>\n</li>\n</ul>\n<h3 id=\"differences-between-classes-and-modules\">Differences Between Classes and Modules</h3>\n<p> The main difference between classes and modules is that classes can be instantiated as objects while standard modules cannot. Because there is only one copy of a standard module&#39;s data, when one part of your program changes a public variable in a standard module, any other part of the program gets the same value if it then reads that variable. In contrast, object data exists separately for each instantiated object. Another difference is that unlike standard modules, classes can implement interfaces.  </p>\n<div class=\"NOTE\"><h5>Note</h5><p> When the <code>Shared</code> modifier is applied to a class member, it is associated with the class itself instead of a particular instance of the class. The member is accessed directly by using the class name, the same way module members are accessed.  </p>\n</div>\n<p> Classes and modules also use different scopes for their members. Members defined within a class are scoped within a specific instance of the class and exist only for the lifetime of the object. To access class members from outside a class, you must use fully qualified names in the format of <em>Object</em>.<em>Member</em>.  </p>\n<p> On the other hand, members declared within a module are publicly accessible by default, and can be accessed by any code that can access the module. This means that variables in a standard module are effectively global variables because they are visible from anywhere in your project, and they exist for the life of the program.  </p>\n<h2 id=\"reusing-classes-and-objects\">Reusing Classes and Objects</h2>\n<p> Objects let you declare variables and procedures once and then reuse them whenever needed. For example, if you want to add a spelling checker to an application you could define all the variables and support functions to provide spell-checking functionality. If you create your spelling checker as a class, you can then reuse it in other applications by adding a reference to the compiled assembly. Better yet, you may be able to save yourself some work by using a spelling checker class that someone else has already developed.  </p>\n<p> The .NET Framework provides many examples of components that are available for use. The following example uses the <a class=\"xref\" href=\"../../../../../api/system.timezone\" data-linktype=\"relative-path\">TimeZone</a> class in the <a class=\"xref\" href=\"../../../../../api/system\" data-linktype=\"relative-path\">System</a> namespace. <a class=\"xref\" href=\"../../../../../api/system.timezone\" data-linktype=\"relative-path\">TimeZone</a> provides members that allow you to retrieve information about the time zone of the current computer system.  </p>\n<pre class=\"loading\"><code>Public Sub examineTimeZone()  \n    Dim tz As System.TimeZone = System.TimeZone.CurrentTimeZone  \n    Dim s As String = &quot;Current time zone is &quot;  \n    s &amp;= CStr(tz.GetUtcOffset(Now).Hours) &amp; &quot; hours and &quot;  \n    s &amp;= CStr(tz.GetUtcOffset(Now).Minutes) &amp; &quot; minutes &quot;  \n    s &amp;= &quot;different from UTC (coordinated universal time)&quot;  \n    s &amp;= vbCrLf &amp; &quot;and is currently &quot;  \n    If tz.IsDaylightSavingTime(Now) = False Then s &amp;= &quot;not &quot;  \n    s &amp;= &quot;on &quot;&quot;summer time&quot;&quot;.&quot;  \n    MsgBox(s)  \nEnd Sub  \n</code></pre><p> In the preceding example, the first <a href=\"../../../language-reference/statements/dim-statement\" data-linktype=\"relative-path\">Dim Statement</a> declares an object variable of type <a class=\"xref\" href=\"../../../../../api/system.timezone\" data-linktype=\"relative-path\">TimeZone</a> and assigns to it a <a class=\"xref\" href=\"../../../../../api/system.timezone\" data-linktype=\"relative-path\">TimeZone</a> object returned by the <a class=\"xref\" href=\"../../../../../api/system.timezone#System_TimeZone_CurrentTimeZone_\" data-linktype=\"relative-path\">CurrentTimeZone</a> property.  </p>\n<h2 id=\"relationships-among-objects\">Relationships Among Objects</h2>\n<p> Objects can be related to each other in several ways. The principal kinds of relationship are <em>hierarchical</em> and <em>containment</em>.  </p>\n<h3 id=\"hierarchical-relationship\">Hierarchical Relationship</h3>\n<p> When classes are derived from more fundamental classes, they are said to have a <em>hierarchical relationship</em>. Class hierarchies are useful when describing items that are a subtype of a more general class.  </p>\n<p> In the following example, suppose you want to define a special kind of <a class=\"xref\" href=\"../../../../../api/system.windows.forms.button\" data-linktype=\"relative-path\">Button</a> that acts like a normal <a class=\"xref\" href=\"../../../../../api/system.windows.forms.button\" data-linktype=\"relative-path\">Button</a> but also exposes a method that reverses the foreground and background colors.  </p>\n<h5 id=\"to-define-a-class-is-derived-from-an-already-existing-class\">To define a class is derived from an already existing class</h5>\n<ol>\n<li><p>Use a <a href=\"../../../language-reference/statements/class-statement\" data-linktype=\"relative-path\">Class Statement</a> to define a class from which to create the object you need.  </p>\n<p> <code>Public Class reversibleButton</code>  </p>\n<p> Be sure an <code>End Class</code> statement follows the last line of code in your class. By default, the integrated development environment (IDE) automatically generates an <code>End Class</code> when you enter a <code>Class</code> statement.  </p>\n</li>\n<li><p>Follow the <code>Class</code> statement immediately with an <a href=\"../../../language-reference/statements/inherits-statement\" data-linktype=\"relative-path\">Inherits Statement</a>. Specify the class from which your new class derives.  </p>\n<p> <code>Inherits System.Windows.Forms.Button</code>  </p>\n<p> Your new class inherits all the members defined by the base class.  </p>\n</li>\n<li><p>Add the code for the additional members your derived class exposes. For example, you might add a <code>reverseColors</code> method, and your derived class might look as follows:  </p>\n<pre class=\"loading\"><code>Public Class reversibleButton  \n    Inherits System.Windows.Forms.Button  \n    Public Sub reverseColors()   \n        Dim saveColor As System.Drawing.Color = Me.BackColor  \n        Me.BackColor = Me.ForeColor  \n        Me.ForeColor = saveColor  \n    End Sub  \nEnd Class   \n</code></pre><p> If you create an object from the <code>reversibleButton</code> class, it can access all the members of the <a class=\"xref\" href=\"../../../../../api/system.windows.forms.button\" data-linktype=\"relative-path\">Button</a> class, as well as the <code>reverseColors</code> method and any other new members you define on <code>reversibleButton</code>.  </p>\n</li>\n</ol>\n<p> Derived classes inherit members from the class they are based on, allowing you to add complexity as you progress in a class hierarchy. For more information, see <a href=\"inheritance-basics\" data-linktype=\"relative-path\">Inheritance Basics</a>.  </p>\n<h4 id=\"compiling-the-code\">Compiling the Code</h4>\n<p> Be sure the compiler can access the class from which you intend to derive your new class. This might mean fully qualifying its name, as in the preceding example, or identifying its namespace in an <a href=\"../../../language-reference/statements/imports-statement-net-namespace-and-type\" data-linktype=\"relative-path\">Imports Statement (.NET Namespace and Type)</a>. If the class is in a different project, you might need to add a reference to that project. For more information, see <a href=\"https://docs.microsoft.com/visualstudio/ide/managing-references-in-a-project\" data-linktype=\"external\">Managing references in a project</a>.  </p>\n<h3 id=\"containment-relationship\">Containment Relationship</h3>\n<p> Another way that objects can be related is a <em>containment relationship</em>. Container objects logically encapsulate other objects. For example, the <a class=\"xref\" href=\"../../../../../api/system.operatingsystem\" data-linktype=\"relative-path\">OperatingSystem</a> object logically contains a <a class=\"xref\" href=\"../../../../../api/system.version\" data-linktype=\"relative-path\">Version</a> object, which it returns through its <a class=\"xref\" href=\"../../../../../api/system.operatingsystem#System_OperatingSystem_Version_\" data-linktype=\"relative-path\">Version</a> property. Note that the container object does not physically contain any other object.  </p>\n<h4 id=\"collections\">Collections</h4>\n<p> One particular type of object containment is represented by <em>collections</em>. Collections are groups of similar objects that can be enumerated. Visual Basic supports a specific syntax in the <a href=\"../../../language-reference/statements/for-each-next-statement\" data-linktype=\"relative-path\">For Each...Next Statement</a> that allows you to iterate through the items of a collection. Additionally, collections often allow you to use an <a class=\"xref\" href=\"../../../../../api/microsoft.visualbasic.collection#Microsoft_VisualBasic_Collection_Item_\" data-linktype=\"relative-path\">Item</a> to retrieve elements by their index or by associating them with a unique string. Collections can be easier to use than arrays because they allow you to add or remove items without using indexes. Because of their ease of use, collections are often used to store forms and controls.  </p>\n<h2 id=\"related-topics\">Related Topics</h2>\n<p> <a href=\"walkthrough-defining-classes\" data-linktype=\"relative-path\">Walkthrough: Defining Classes</a><br> Provides a step-by-step description of how to create a class.  </p>\n<p> <a href=\"overloaded-properties-and-methods\" data-linktype=\"relative-path\">Overloaded Properties and Methods</a><br> Overloaded Properties and Methods  </p>\n<p> <a href=\"inheritance-basics\" data-linktype=\"relative-path\">Inheritance Basics</a><br> Covers inheritance modifiers, overriding methods and properties, MyClass, and MyBase.  </p>\n<p> <a href=\"object-lifetime-how-objects-are-created-and-destroyed\" data-linktype=\"relative-path\">Object Lifetime: How Objects Are Created and Destroyed</a><br> Discusses creating and disposing of class instances.  </p>\n<p> <a href=\"anonymous-types\" data-linktype=\"relative-path\">Anonymous Types</a><br> Describes how to create and use anonymous types, which allow you to create objects without writing a class definition for the data type.  </p>\n<p> <a href=\"object-initializers-named-and-anonymous-types\" data-linktype=\"relative-path\">Object Initializers: Named and Anonymous Types</a><br> Discusses object initializers, which are used to create instances of named and anonymous types by using a single expression.  </p>\n<p> <a href=\"how-to-infer-property-names-and-types-in-anonymous-type-declarations\" data-linktype=\"relative-path\">How to: Infer Property Names and Types in Anonymous Type Declarations</a><br> Explains how to infer property names and types in anonymous type declarations. Provides examples of successful and unsuccessful inference.</p>\n</div></div>","outputRootRelativePath":"../../../../../","pageMetadata":"<meta name=\"author\" content=\"stevehoag\">\r\n<meta name=\"ms.author\" content=\"shoag\">\r\n<meta name=\"manager\" content=\"wpickett\">\r\n<meta name=\"breadcrumb_path\" content=\"../toc2.json\">\r\n<meta name=\"apiPlatform\" content=\"dotnet\">\r\n<meta name=\"ms.suite\" content=\"\">\r\n<meta name=\"ms.custom\" content=\"\">\r\n<meta name=\"ms.assetid\" content=\"c68c5752-1006-46e1-975a-6717b62a42fc\">\r\n<meta name=\"translation.priority.ht\" content=\"cs-cz\">\r\n<meta name=\"translation.priority.ht\" content=\"de-de\">\r\n<meta name=\"translation.priority.ht\" content=\"es-es\">\r\n<meta name=\"translation.priority.ht\" content=\"fr-fr\">\r\n<meta name=\"translation.priority.ht\" content=\"it-it\">\r\n<meta name=\"translation.priority.ht\" content=\"ja-jp\">\r\n<meta name=\"translation.priority.ht\" content=\"ko-kr\">\r\n<meta name=\"translation.priority.ht\" content=\"pl-pl\">\r\n<meta name=\"translation.priority.ht\" content=\"pt-br\">\r\n<meta name=\"translation.priority.ht\" content=\"ru-ru\">\r\n<meta name=\"translation.priority.ht\" content=\"tr-tr\">\r\n<meta name=\"translation.priority.ht\" content=\"zh-cn\">\r\n<meta name=\"translation.priority.ht\" content=\"zh-tw\">\r\n<meta name=\"caps.latest.revision\" content=\"26\">\r\n<meta name=\"ms.topic\" content=\"article\">\r\n<meta name=\"ms.date\" content=\"2015-07-20\">\r\n<meta name=\"ms.technology\" content=\"devlang-visual-basic\">\r\n<meta name=\"ms.prod\" content=\".net\">\r\n<meta name=\"ms.reviewer\" content=\"\">\r\n<meta name=\"search.ms_sitename\" content=\"Docs\">\r\n<meta name=\"search.ms_docsetname\" content=\"docs-internal\">\r\n<meta name=\"version\" content=\"0\">\r\n<meta name=\"locale\" content=\"en-us\">\r\n<meta name=\"site_name\" content=\"Docs\">\r\n<meta name=\"search.ms_product\" content=\"MSDN\">\r\n<meta name=\"depot_name\" content=\"MSDN.docs-internal\">\r\n<meta name=\"updated_at\" content=\"2017-03-15 06:14 PM\">\r\n<meta name=\"gitcommit\" content=\"https://github.com/dotnet/docs-internal/blob/0a5d76c154aeb9b749c9c3fc5ad0962e93754a62/docs/visual-basic/programming-guide/language-features/objects-and-classes/index.md\">\r\n<meta name=\"original_content_git_url\" content=\"https://github.com/dotnet/docs-internal/blob/master/docs/visual-basic/programming-guide/language-features/objects-and-classes/index.md\">\r\n<meta name=\"document_id\" content=\"b8241070-bab3-f93b-20eb-32b8971084e6\">\r\n<meta name=\"pagetype\" content=\"Conceptual\">\r\n<meta name=\"toc_rel\" content=\"toc2.json\">\r\n","rawMetadata":{"author":"stevehoag","ms.author":"shoag","manager":"wpickett","breadcrumb_path":"/dotnet/toc.json","apiPlatform":"dotnet","title":"Objects and Classes in Visual Basic | Microsoft Docs","ms.suite":"","ms.custom":"","ms.assetid":"c68c5752-1006-46e1-975a-6717b62a42fc","translation.priority.ht":["cs-cz","de-de","es-es","fr-fr","it-it","ja-jp","ko-kr","pl-pl","pt-br","ru-ru","tr-tr","zh-cn","zh-tw"],"caps.latest.revision":26,"ms.topic":"article","dev_langs":["vb"],"helpviewer_keywords":["classes [Visual Basic]","objects [Visual Basic]"],"ms.date":"2015-07-20","ms.technology":["devlang-visual-basic"],"ms.prod":".net","ms.reviewer":"","search.ms_sitename":"Docs","search.ms_docsetname":"docs-internal","version":0,"_op_canonicalUrlPrefix":"https://docs.microsoft.com/en-us/dotnet-internal/","locale":"en-us","site_name":"Docs","search.ms_product":"MSDN","_op_openToPublicContributors":false,"depot_name":"MSDN.docs-internal","_op_gitCommitHistory":[{"author_name":"Steve Hoag","author_email":"shoag@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"Reorganizing the VB TOC (#1348)","commit_sha":"0a5d76c154aeb9b749c9c3fc5ad0962e93754a62","commit_date":"2017-02-14 10:22:48 -0800"},{"author_name":"Maira Wenzel","author_email":"mairaw@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"Metadata updates (#1313)","commit_sha":"90fe68f7f3c4b46502b5d3770b1a2d57c6af748a","commit_date":"2016-12-09 12:40:41 -0800"},{"author_name":"Maira Wenzel","author_email":"mairaw@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"Absolute urls and other fixes (#1281)","commit_sha":"f7dffe4885b331cec8d37f3cc5c9163f69c3b4c9","commit_date":"2016-11-22 12:57:26 -0800"},{"author_name":"Maira Wenzel","author_email":"mairaw@microsoft.com","committer_name":"Bill Wagner","comitter_email":"wiwagn@microsoft.com","message":":books: migration changes (#1235)","commit_sha":"b828bb1d6c8fb750ad9ef34f8a7a1b7d2574f4c6","commit_date":"2016-11-15 15:08:11 -0500"}],"updated_at":"2017-03-15 06:14 PM","_op_gitContributorInformation":{"author":{"profile_url":"https://github.com/stevehoag","display_name":"Steve Hoag","id":"13489215"},"contributors":[{"profile_url":"https://github.com/stevehoag","display_name":"Steve Hoag"},{"profile_url":"https://github.com/mairaw","display_name":"Maira Wenzel","id":"12971179"}],"update_at":"3/15/2017"},"gitcommit":"https://github.com/dotnet/docs-internal/blob/0a5d76c154aeb9b749c9c3fc5ad0962e93754a62/docs/visual-basic/programming-guide/language-features/objects-and-classes/index.md","original_content_git_url":"https://github.com/dotnet/docs-internal/blob/master/docs/visual-basic/programming-guide/language-features/objects-and-classes/index.md","open_to_public_contributors":false,"content_git_url":"https://github.com/dotnet/docs/blob/master/docs/visual-basic/programming-guide/language-features/objects-and-classes/index.md","document_id":"b8241070-bab3-f93b-20eb-32b8971084e6","layout":"Conceptual","pagetype":"Conceptual","canonical_url":"https://docs.microsoft.com/en-us/dotnet/articles/visual-basic/programming-guide/language-features/objects-and-classes/index","toc_asset_id":"articles/visual-basic/programming-guide/language-features/objects-and-classes/toc.json","toc_rel":"toc.json","_op_ogTitle":"Objects and Classes in Visual Basic","_op_displayDate":null,"_op_displayDate_source":null,"_op_wordCount":2384,"_op_rawTitle":"<h1 id=\"objects-and-classes-in-visual-basic\" sourcefile=\"docs/visual-basic/programming-guide/language-features/objects-and-classes/index.md\" sourcestartlinenumber=\"37\" sourceendlinenumber=\"37\">Objects and Classes in Visual Basic</h1>","_op_searchScope":[".NET"],"_op_canonicalUrl":"https://docs.microsoft.com/en-us/dotnet/articles/visual-basic/programming-guide/language-features/objects-and-classes/index","fileRelativePath":"articles/visual-basic/programming-guide/language-features/objects-and-classes/index.html"},"themesRelativePathToOutputRoot":"_themes/"}