{"content":"<div><div class=\"content\">\n<h2 id=\"types-variables-and-values\">Types, Variables, and Values</h2>\n<p> C# is a strongly-typed language. Every variable and constant has a type, as does every expression that evaluates to a value. Every method signature specifies a type for each input parameter and for the return value. The .NET Framework class library defines a set of built-in numeric types as well as more complex types that represent a wide variety of logical constructs, such as the file system, network connections, collections and arrays of objects, and dates. A typical C# program uses types from the class library as well as user-defined types that model the concepts that are specific to the program&#39;s problem domain.  </p>\n<p> The information stored in a type can include the following:  </p>\n<ul>\n<li><p>The storage space that a variable of the type requires.  </p>\n</li>\n<li><p>The maximum and minimum values that it can represent.  </p>\n</li>\n<li><p>The members (methods, fields, events, and so on) that it contains.  </p>\n</li>\n<li><p>The base type it inherits from.  </p>\n</li>\n<li><p>The location where the memory for variables will be allocated at run time.  </p>\n</li>\n<li><p>The kinds of operations that are permitted.  </p>\n<p>The compiler uses type information to make sure that all operations that are performed in your code are <em>type safe</em>. For example, if you declare a variable of type <a href=\"../../language-reference/keywords/int\" data-linktype=\"relative-path\">int</a>, the compiler allows you to use the variable in addition and subtraction operations. If you try to perform those same operations on a variable of type <a href=\"../../language-reference/keywords/bool\" data-linktype=\"relative-path\">bool</a>, the compiler generates an error, as shown in the following example:  </p>\n<pre><code class=\"lang-cs\" name=\"csProgGuideTypes#42\">            int a = 5;             \n            int b = a + 2; //OK\n            \n            bool test = true;\n              \n            // Error. Operator &#39;+&#39; cannot be applied to operands of type &#39;int&#39; and &#39;bool&#39;.\n            int c = a + test;\n</code></pre></li>\n</ul>\n<div class=\"NOTE\"><h5>Note</h5><p> C and C++ developers, notice that in C#, <a href=\"../../language-reference/keywords/bool\" data-linktype=\"relative-path\">bool</a> is not convertible to <a href=\"../../language-reference/keywords/int\" data-linktype=\"relative-path\">int</a>.  </p>\n</div>\n<p> The compiler embeds the type information into the executable file as metadata. The common language runtime (CLR) uses that metadata at run time to further guarantee type safety when it allocates and reclaims memory.  </p>\n<h3 id=\"specifying-types-in-variable-declarations\">Specifying Types in Variable Declarations</h3>\n<p> When you declare a variable or constant in a program, you must either specify its type or use the <a href=\"../../language-reference/keywords/var\" data-linktype=\"relative-path\">var</a> keyword to let the compiler infer the type. The following example shows some variable declarations that use both built-in numeric types and complex user-defined types:  </p>\n<pre><code class=\"lang-cs\" name=\"csProgGuideTypes#36\">            // Declaration only:\n            float temperature;\n            string name;\n            MyClass myClass;\n\n            // Declaration with initializers (four examples):\n            char firstLetter = &#39;C&#39;;\n            var limit = 3;\n            int[] source = { 0, 1, 2, 3, 4, 5 };\n            var query = from item in source\n                        where item &lt;= limit\n                        select item;\n</code></pre><p> The types of method parameters and return values are specified in the method signature. The following signature shows a method that requires an <a href=\"../../language-reference/keywords/int\" data-linktype=\"relative-path\">int</a> as an input argument and returns a string:  </p>\n<pre><code class=\"lang-cs\" name=\"csProgGuideTypes#35\">            public string GetName(int ID)\n            {\n                if (ID &lt; names.Length)\n                    return names[ID];\n                else\n                    return String.Empty;\n            }\n            private string[] names = { &quot;Spencer&quot;, &quot;Sally&quot;, &quot;Doug&quot; };\n</code></pre><p> After a variable is declared, it cannot be re-declared with a new type, and it cannot be assigned a value that is not compatible with its declared type. For example, you cannot declare an <a href=\"../../language-reference/keywords/int\" data-linktype=\"relative-path\">int</a> and then assign it a Boolean value of <a href=\"../../language-reference/keywords/true-literal\" data-linktype=\"relative-path\">true</a>. However, values can be converted to other types, for example when they are assigned to new variables or passed as method arguments. A <em>type conversion</em> that does not cause data loss is performed automatically by the compiler. A conversion that might cause data loss requires a <em>cast</em> in the source code.  </p>\n<p> For more information, see <a href=\"casting-and-type-conversions\" data-linktype=\"relative-path\">Casting and Type Conversions</a>.  </p>\n<h2 id=\"built-in-types\">Built-in Types</h2>\n<p> C# provides a standard set of built-in numeric types to represent integers, floating point values, Boolean expressions, text characters, decimal values, and other types of data. There are also built-in <code>string</code> and <code>object</code> types. These are available for you to use in any C# program. For a more information about the built-in types, see <a href=\"../../language-reference/keywords/reference-tables-for-types\" data-linktype=\"relative-path\">Reference Tables for Types</a>.  </p>\n<h2 id=\"custom-types\">Custom Types</h2>\n<p> You use the <a href=\"../../language-reference/keywords/struct\" data-linktype=\"relative-path\">struct</a>, <a href=\"../../language-reference/keywords/class\" data-linktype=\"relative-path\">class</a>, <a href=\"../../language-reference/keywords/interface\" data-linktype=\"relative-path\">interface</a>, and <a href=\"../../language-reference/keywords/enum\" data-linktype=\"relative-path\">enum</a> constructs to create your own custom types. The .NET Framework class library itself is a collection of custom types provided by Microsoft that you can use in your own applications. By default, the most frequently used types in the class library are available in any C# program. Others become available only when you explicitly add a project reference to the assembly in which they are defined. After the compiler has a reference to the assembly, you can declare variables (and constants) of the types declared in that assembly in source code. For more information, see <a href=\"http://go.microsoft.com/fwlink/?LinkID=217856\" data-linktype=\"external\">.NET Framework Class Library</a>.  </p>\n<h2 id=\"the-common-type-system\">The Common Type System</h2>\n<p> It is important to understand two fundamental points about the type system in the .NET Framework:  </p>\n<ul>\n<li><p>It supports the principle of inheritance. Types can derive from other types, called <em>base types</em>. The derived type inherits (with some restrictions) the methods, properties, and other members of the base type. The base type can in turn derive from some other type, in which case the derived type inherits the members of both base types in its inheritance hierarchy. All types, including built-in numeric types such as <a class=\"xref\" href=\"../../../../api/system.int32\" data-linktype=\"relative-path\">System.Int32</a> (C# keyword: <a href=\"../../language-reference/keywords/int\" data-linktype=\"relative-path\">int</a>), derive ultimately from a single base type, which is <a class=\"xref\" href=\"../../../../api/system.object\" data-linktype=\"relative-path\">System.Object</a> (C# keyword: <a href=\"../../language-reference/keywords/object\" data-linktype=\"relative-path\">object</a>). This unified type hierarchy is called the <a href=\"http://msdn.microsoft.com/library/53c57c96-83e1-4ee3-9543-9ac832671a89\" data-linktype=\"external\">Common Type System</a> (CTS). For more information about inheritance in C#, see <a href=\"../classes-and-structs/inheritance\" data-linktype=\"relative-path\">Inheritance</a>.  </p>\n</li>\n<li><p>Each type in the CTS is defined as either a <em>value type</em> or a <em>reference type</em>. This includes all custom types in the .NET Framework class library and also your own user-defined types. Types that you define by using the <a href=\"../../language-reference/keywords/struct\" data-linktype=\"relative-path\">struct</a> keyword are value types; all the built-in numeric types are <code>structs</code>. Types that you define by using the <a href=\"../../language-reference/keywords/class\" data-linktype=\"relative-path\">class</a> keyword are reference types. Reference types and value types have different compile-time rules, and different run-time behavior.  </p>\n<p>The following illustration shows the relationship between value types and reference types in the CTS.  </p>\n<p><img src=\"media/valuetypescts.png\" alt=\"Value Types and Reference Types\" title=\"ValueTypesCTS\" data-linktype=\"relative-path\"><br>Value types and reference types in the CTS  </p>\n</li>\n</ul>\n<div class=\"NOTE\"><h5>Note</h5><p> You can see that the most commonly used types are all organized in the <a class=\"xref\" href=\"../../../../api/system\" data-linktype=\"relative-path\">System</a> namespace. However, the namespace in which a type is contained has no relation to whether it is a value type or reference type.  </p>\n</div>\n<h3 id=\"value-types\">Value Types</h3>\n<p> Value types derive from <a class=\"xref\" href=\"../../../../api/system.valuetype\" data-linktype=\"relative-path\">System.ValueType</a>, which derives from <a class=\"xref\" href=\"../../../../api/system.object\" data-linktype=\"relative-path\">System.Object</a>. Types that derive from <a class=\"xref\" href=\"../../../../api/system.valuetype\" data-linktype=\"relative-path\">System.ValueType</a> have special behavior in the CLR. Value type variables directly contain their values, which means that the memory is allocated inline in whatever context the variable is declared. There is no separate heap allocation or garbage collection overhead for value-type variables.  </p>\n<p> There are two categories of value types: <a href=\"../../language-reference/keywords/struct\" data-linktype=\"relative-path\">struct</a> and <a href=\"../../language-reference/keywords/enum\" data-linktype=\"relative-path\">enum</a>.  </p>\n<p> The built-in numeric types are structs, and they have properties and methods that you can access:  </p>\n<pre class=\"loading\"><code class=\"lang-cs\">// Static method on type Byte.  \nbyte b = Byte.MaxValue;  \n</code></pre><p> But you declare and assign values to them as if they were simple non-aggregate types:  </p>\n<pre class=\"loading\"><code class=\"lang-cs\">byte num = 0xA;  \nint i = 5;  \nchar c = &#39;Z&#39;;  \n</code></pre><p> Value types are <em>sealed</em>, which means, for example, that you cannot derive a type from <a class=\"xref\" href=\"../../../../api/system.int32\" data-linktype=\"relative-path\">System.Int32</a>, and you cannot define a struct to inherit from any user-defined class or struct because a struct can only inherit from <a class=\"xref\" href=\"../../../../api/system.valuetype\" data-linktype=\"relative-path\">System.ValueType</a>. However, a struct can implement one or more interfaces. You can cast a struct type to an interface type; this causes a <em>boxing</em> operation to wrap the struct inside a reference type object on the managed heap. Boxing operations occur when you pass a value type to a method that takes a <a class=\"xref\" href=\"../../../../api/system.object\" data-linktype=\"relative-path\">System.Object</a> as an input parameter. For more information, see <a href=\"boxing-and-unboxing\" data-linktype=\"relative-path\">Boxing and Unboxing</a>.  </p>\n<p> You use the <a href=\"../../language-reference/keywords/struct\" data-linktype=\"relative-path\">struct</a> keyword to create your own custom value types. Typically, a struct is used as a container for a small set of related variables, as shown in the following example:  </p>\n<pre><code class=\"lang-cs\" name=\"csProgGuideObjects#1\">    public struct CoOrds\n    {\n        public int x, y;\n\n        public CoOrds(int p1, int p2)\n        {\n            x = p1;\n            y = p2;\n        }\n    }\n</code></pre><p> For more information about structs, see <a href=\"../classes-and-structs/structs\" data-linktype=\"relative-path\">Structs</a>. For more information about value types in the .NET Framework, see <a href=\"http://msdn.microsoft.com/library/53c57c96-83e1-4ee3-9543-9ac832671a89\" data-linktype=\"external\">Common Type System</a>.  </p>\n<p> The other category of value types is <a href=\"../../language-reference/keywords/enum\" data-linktype=\"relative-path\">enum</a>. An enum defines a set of named integral constants. For example, the <a class=\"xref\" href=\"../../../../api/system.io.filemode\" data-linktype=\"relative-path\">System.IO.FileMode</a> enumeration in the .NET Framework class library contains a set of named constant integers that specify how a file should be opened. It is defined as shown in the following example:  </p>\n<pre><code class=\"lang-cs\" name=\"csProgGuideTypes#44\">    public enum FileMode\n    {\n        CreateNew = 1,\n        Create = 2,\n        Open = 3,\n        OpenOrCreate = 4,\n        Truncate = 5,\n        Append = 6,\n    }\n</code></pre><p> The <code>System.IO.FileMode.Create</code> constant has a value of 2. However, the name is much more meaningful for humans reading the source code, and for that reason it is better to use enumerations instead of constant literal numbers. For more information, see <a class=\"xref\" href=\"../../../../api/system.io.filemode\" data-linktype=\"relative-path\">System.IO.FileMode</a>.  </p>\n<p> All enums inherit from <a class=\"xref\" href=\"../../../../api/system.enum\" data-linktype=\"relative-path\">System.Enum</a>, which inherits from <a class=\"xref\" href=\"../../../../api/system.valuetype\" data-linktype=\"relative-path\">System.ValueType</a>. All the rules that apply to structs also apply to enums. For more information about enums, see <a href=\"../enumeration-types\" data-linktype=\"relative-path\">Enumeration Types</a>.  </p>\n<h3 id=\"reference-types\">Reference Types</h3>\n<p> A type that is defined as a <a href=\"../../language-reference/keywords/class\" data-linktype=\"relative-path\">class</a>, <a href=\"../../language-reference/keywords/delegate\" data-linktype=\"relative-path\">delegate</a>, array, or <a href=\"../../language-reference/keywords/interface\" data-linktype=\"relative-path\">interface</a> is a <em>reference type</em>. At run time, when you declare a variable of a reference type, the variable contains the value <a href=\"../../language-reference/keywords/null\" data-linktype=\"relative-path\">null</a> until you explicitly create an instance of the object by using the <a href=\"../../language-reference/keywords/new\" data-linktype=\"relative-path\">new</a> operator, or assign it an object that has been created elsewhere by using <code>new, as shown in the following example:</code>  </p>\n<pre class=\"loading\"><code class=\"lang-cs\">MyClass mc = new MyClass();  \nMyClass mc2 = mc;  \n</code></pre><p>   An interface must be initialized together with a class object that implements it. If <code>MyClass</code> implements <code>IMyInterface</code>, you create an instance of <code>IMyInterface</code> as shown in the following example:  </p>\n<pre class=\"loading\"><code class=\"lang-cs\">IMyInterface iface = new MyClass();  \n</code></pre><p> When the object is created, the memory is allocated on the managed heap, and the variable holds only a reference to the location of the object. Types on the managed heap require overhead both when they are allocated and when they are reclaimed by the automatic memory management functionality of the CLR, which is known as <em>garbage collection</em>. However, garbage collection is also highly optimized, and in most scenarios it does not create a performance issue. For more information about garbage collection, see <a href=\"http://msdn.microsoft.com/library/d4850de5-fa63-4936-a250-5678d118acba\" data-linktype=\"external\">Automatic Memory Management</a>.  </p>\n<p> All arrays are reference types, even if their elements are value types. Arrays implicitly derive from the <a class=\"xref\" href=\"../../../../api/system.array\" data-linktype=\"relative-path\">System.Array</a> class, but you declare and use them with the simplified syntax that is provided by C#, as shown in the following example:  </p>\n<pre><code class=\"lang-cs\" name=\"csProgGuideTypes#45\">            // Declare and initialize an array of integers.\n            int[] nums = { 1, 2, 3, 4, 5 };\n\n            // Access an instance property of System.Array.\n            int len = nums.Length;\n</code></pre><p> Reference types fully support inheritance. When you create a class, you can inherit from any other interface or class that is not defined as <a href=\"../../language-reference/keywords/sealed\" data-linktype=\"relative-path\">sealed</a>, and other classes can inherit from your class and override your virtual methods. For more information about how to create your own classes, see <a href=\"../classes-and-structs/index\" data-linktype=\"relative-path\">Classes and Structs</a>. For more information about inheritance and virtual methods, see <a href=\"../classes-and-structs/inheritance\" data-linktype=\"relative-path\">Inheritance</a>.  </p>\n<h2 id=\"types-of-literal-values\">Types of Literal Values</h2>\n<p> In C#, literal values receive a type from the compiler. You can specify how a numeric literal should be typed by appending a letter to the end of the number. For example, to specify that the value 4.56 should be treated as a float, append an &quot;f&quot; or &quot;F&quot; after the number: <code>4.56f</code>. If no letter is appended, the compiler will infer a type for the literal. For more information about which types can be specified with letter suffixes, see the reference pages for individual types in <a href=\"../../language-reference/keywords/value-types\" data-linktype=\"relative-path\">Value Types</a>.  </p>\n<p> Because literals are typed, and all types derive ultimately from <a class=\"xref\" href=\"../../../../api/system.object\" data-linktype=\"relative-path\">System.Object</a>, you can write and compile code such as the following:  </p>\n<pre><code class=\"lang-cs\" name=\"csProgGuideTypes#37\">            string s = &quot;The answer is &quot; + 5.ToString();\n            // Outputs: &quot;The answer is 5&quot;\n            Console.WriteLine(s);\n\n            Type type = 12345.GetType();\n            // Outputs: &quot;System.Int32&quot;\n            Console.WriteLine(type);\n</code></pre><h2 id=\"generic-types\">Generic Types</h2>\n<p> A type can be declared with one or more <em>type parameters</em> that serve as a placeholder for the actual type (the <em>concrete type</em>) that client code will provide when it creates an instance of the type. Such types are called <em>generic types</em>. For example, the .NET Framework type <a class=\"xref\" href=\"../../../../api/system.collections.generic.list-1\" data-linktype=\"relative-path\">System.Collections.Generic.List&lt;T&gt;</a> has one type parameter that by convention is given the name <em>T</em>. When you create an instance of the type, you specify the type of the objects that the list will contain, for example, string:  </p>\n<pre class=\"loading\"><code class=\"lang-cs\">List&lt;string&gt; stringList = new List&lt;string&gt;();\nstringList.Add(&quot;String example&quot;);\n// compile time error adding a type other than a string:\nstringList.Add(4);\n</code></pre><p> The use of the type parameter makes it possible to reuse the same class to hold any type of element, without having to convert each element to <a href=\"../../language-reference/keywords/object\" data-linktype=\"relative-path\">object</a>. Generic collection classes are called <em>strongly-typed collections</em> because the compiler knows the specific type of the collection&#39;s elements and can raise an error at compile-time if, for example, you try to add an integer to the <code>strings</code> object in the previous example. For more information, see <a href=\"../generics/index\" data-linktype=\"relative-path\">Generics</a>.  </p>\n<h2 id=\"implicit-types-anonymous-types-and-nullable-types\">Implicit Types, Anonymous Types, and Nullable Types</h2>\n<p> As stated previously, you can implicitly type a local variable (but not class members) by using the <a href=\"../../language-reference/keywords/var\" data-linktype=\"relative-path\">var</a> keyword. The variable still receives a type at compile time, but the type is provided by the compiler. For more information, see <a href=\"../classes-and-structs/implicitly-typed-local-variables\" data-linktype=\"relative-path\">Implicitly Typed Local Variables</a>.  </p>\n<p> In some cases, it is inconvenient to create a named type for simple sets of related values that you do not intend to store or pass outside method boundaries. You can create <em>anonymous types</em> for this purpose. For more information, see <a href=\"../classes-and-structs/anonymous-types\" data-linktype=\"relative-path\">Anonymous Types</a>.  </p>\n<p> Ordinary value types cannot have a value of <a href=\"../../language-reference/keywords/null\" data-linktype=\"relative-path\">null</a>. However, you can create nullable value types by affixing a <code>?</code> after the type. For example, <code>int?</code> is an <code>int</code> type that can also have the value <a href=\"../../language-reference/keywords/null\" data-linktype=\"relative-path\">null</a>. In the CTS, nullable types are instances of the generic struct type <a class=\"xref\" href=\"../../../../api/system.nullable-1\" data-linktype=\"relative-path\">System.Nullable&lt;T&gt;</a>. Nullable types are especially useful when you are passing data to and from databases in which numeric values might be null. For more information, see <a href=\"../nullable-types/index\" data-linktype=\"relative-path\">Nullable Types</a>.  </p>\n<h2 id=\"related-sections\">Related Sections</h2>\n<p> For more information, see the following topics:  </p>\n<ul>\n<li><p><a href=\"casting-and-type-conversions\" data-linktype=\"relative-path\">Casting and Type Conversions</a>  </p>\n</li>\n<li><p><a href=\"boxing-and-unboxing\" data-linktype=\"relative-path\">Boxing and Unboxing</a>  </p>\n</li>\n<li><p><a href=\"using-type-dynamic\" data-linktype=\"relative-path\">Using Type dynamic</a>  </p>\n</li>\n<li><p><a href=\"../../language-reference/keywords/value-types\" data-linktype=\"relative-path\">Value Types</a>  </p>\n</li>\n<li><p><a href=\"../../language-reference/keywords/reference-types\" data-linktype=\"relative-path\">Reference Types</a>  </p>\n</li>\n<li><p><a href=\"../classes-and-structs/index\" data-linktype=\"relative-path\">Classes and Structs</a>  </p>\n</li>\n<li><p><a href=\"../classes-and-structs/anonymous-types\" data-linktype=\"relative-path\">Anonymous Types</a>  </p>\n</li>\n<li><p><a href=\"../generics/index\" data-linktype=\"relative-path\">Generics</a>  </p>\n</li>\n<li><p><a href=\"http://go.microsoft.com/fwlink/?LinkId=221228\" data-linktype=\"external\">Variables and Expressions</a> in <a href=\"http://go.microsoft.com/fwlink/?LinkId=221214\" data-linktype=\"external\">Beginning Visual C# 2010</a>  </p>\n</li>\n</ul>\n<h2 id=\"c-language-specification\">C# Language Specification</h2>\n<p> For more information, see the <a href=\"../../language-reference/language-specification\" data-linktype=\"relative-path\">C# Language Specification</a>. The language specification is the definitive source for C# syntax and usage.  </p>\n<h2 id=\"see-also\">See Also</h2>\n<p> <a href=\"../../language-reference/index\" data-linktype=\"relative-path\">C# Reference</a><br> <a href=\"../index\" data-linktype=\"relative-path\">C# Programming Guide</a><br> <a href=\"http://msdn.microsoft.com/library/a2aa99ba-8239-4818-9281-f1d72ee40bde\" data-linktype=\"external\">Conversion of XML Data Types</a><br> <a href=\"../../language-reference/keywords/integral-types-table\" data-linktype=\"relative-path\">Integral Types Table</a></p>\n</div></div>","outputRootRelativePath":"../../../../","pageMetadata":"<meta name=\"author\" content=\"BillWagner\">\r\n<meta name=\"ms.author\" content=\"wiwagn\">\r\n<meta name=\"manager\" content=\"wpickett\">\r\n<meta name=\"breadcrumb_path\" content=\"/dotnet-internal/toc2.json\">\r\n<meta name=\"ms.assetid\" content=\"f782d7cc-035e-4500-b1b1-36a9881130ad\">\r\n<meta name=\"translation.priority.ht\" content=\"de-de\">\r\n<meta name=\"translation.priority.ht\" content=\"es-es\">\r\n<meta name=\"translation.priority.ht\" content=\"fr-fr\">\r\n<meta name=\"translation.priority.ht\" content=\"it-it\">\r\n<meta name=\"translation.priority.ht\" content=\"ja-jp\">\r\n<meta name=\"translation.priority.ht\" content=\"ko-kr\">\r\n<meta name=\"translation.priority.ht\" content=\"ru-ru\">\r\n<meta name=\"translation.priority.ht\" content=\"zh-cn\">\r\n<meta name=\"translation.priority.ht\" content=\"zh-tw\">\r\n<meta name=\"caps.latest.revision\" content=\"53\">\r\n<meta name=\"ms.topic\" content=\"article\">\r\n<meta name=\"translation.priority.mt\" content=\"cs-cz\">\r\n<meta name=\"translation.priority.mt\" content=\"pl-pl\">\r\n<meta name=\"translation.priority.mt\" content=\"pt-br\">\r\n<meta name=\"translation.priority.mt\" content=\"tr-tr\">\r\n<meta name=\"ms.date\" content=\"2015-07-20\">\r\n<meta name=\"ms.technology\" content=\"devlang-csharp\">\r\n<meta name=\"ms.prod\" content=\".net\">\r\n<meta name=\"search.ms_sitename\" content=\"Docs\">\r\n<meta name=\"search.ms_docsetname\" content=\"docs-internal\">\r\n<meta name=\"version\" content=\"0\">\r\n<meta name=\"locale\" content=\"en-us\">\r\n<meta name=\"site_name\" content=\"Docs\">\r\n<meta name=\"search.ms_product\" content=\"MSDN\">\r\n<meta name=\"depot_name\" content=\"MSDN.docs-internal\">\r\n<meta name=\"updated_at\" content=\"2017-03-21 01:42 AM\">\r\n<meta name=\"gitcommit\" content=\"https://github.com/dotnet/docs-internal/blob/90df3a5183e179a729b5534a278aeb74e8545a55/docs/csharp/programming-guide/types/index.md\">\r\n<meta name=\"original_content_git_url\" content=\"https://github.com/dotnet/docs-internal/blob/tianzhXamarin/docs/csharp/programming-guide/types/index.md\">\r\n<meta name=\"document_id\" content=\"b0ad01e6-0e9b-d41b-3545-d571dbc7e2aa\">\r\n<meta name=\"pagetype\" content=\"Conceptual\">\r\n<meta name=\"toc_rel\" content=\"toc2.json\">\r\n","rawMetadata":{"author":"BillWagner","ms.author":"wiwagn","manager":"wpickett","breadcrumb_path":"/dotnet-internal/toc.json","title":"Types (C# Programming Guide) | Microsoft Docs","ms.assetid":"f782d7cc-035e-4500-b1b1-36a9881130ad","translation.priority.ht":["de-de","es-es","fr-fr","it-it","ja-jp","ko-kr","ru-ru","zh-cn","zh-tw"],"caps.latest.revision":53,"ms.topic":"article","dev_langs":["csharp"],"helpviewer_keywords":["value types [C#]","reference types [C#]","types [C#]","C# language, data types","common type system [C#]","data types [C#]","C# language, types","strong typing [C#]"],"translation.priority.mt":["cs-cz","pl-pl","pt-br","tr-tr"],"ms.date":"2015-07-20","ms.technology":["devlang-csharp"],"ms.prod":".net","search.ms_sitename":"Docs","search.ms_docsetname":"docs-internal","version":0,"_op_canonicalUrlPrefix":"https://docs.microsoft.com/en-us/dotnet-internal/","locale":"en-us","site_name":"Docs","search.ms_product":"MSDN","_op_openToPublicContributors":false,"depot_name":"MSDN.docs-internal","_op_gitCommitHistory":[{"author_name":"Matt Croley","author_email":"matt.croley@gmail.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"Update index.md","commit_sha":"90df3a5183e179a729b5534a278aeb74e8545a55","commit_date":"2017-02-03 16:14:09 -0600"},{"author_name":"Matt Croley","author_email":"matt.croley@gmail.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"Generic Types update","commit_sha":"3977b2421a469130e9e4e8e77a679f5480dcbb88","commit_date":"2017-02-03 10:10:09 -0600"},{"author_name":"Maira Wenzel","author_email":"mairaw@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"Metadata updates (#1313)","commit_sha":"90fe68f7f3c4b46502b5d3770b1a2d57c6af748a","commit_date":"2016-12-09 12:40:41 -0800"},{"author_name":"Maira Wenzel","author_email":"mairaw@microsoft.com","committer_name":"Bill Wagner","comitter_email":"wiwagn@microsoft.com","message":":books: migration changes (#1235)","commit_sha":"b828bb1d6c8fb750ad9ef34f8a7a1b7d2574f4c6","commit_date":"2016-11-15 15:08:11 -0500"}],"updated_at":"2017-03-21 01:42 AM","_op_gitContributorInformation":{"author":{"profile_url":"https://github.com/BillWagner","display_name":"Bill Wagner","id":"493969"},"contributors":[{"profile_url":"https://github.com/BillWagner","display_name":"Bill Wagner"},{"profile_url":"https://github.com/mcroley","display_name":"Matt Croley","id":"8241098"},{"profile_url":"https://github.com/mairaw","display_name":"Maira Wenzel","id":"12971179"}],"update_at":"3/21/2017"},"gitcommit":"https://github.com/dotnet/docs-internal/blob/90df3a5183e179a729b5534a278aeb74e8545a55/docs/csharp/programming-guide/types/index.md","original_content_git_url":"https://github.com/dotnet/docs-internal/blob/tianzhXamarin/docs/csharp/programming-guide/types/index.md","open_to_public_contributors":false,"content_git_url":"https://github.com/dotnet/docs/blob/master/docs/csharp/programming-guide/types/index.md","document_id":"b0ad01e6-0e9b-d41b-3545-d571dbc7e2aa","layout":"Conceptual","pagetype":"Conceptual","canonical_url":"https://docs.microsoft.com/en-us/dotnet-all/articles/csharp/programming-guide/types/index","toc_asset_id":"articles/csharp/programming-guide/types/toc.json","toc_rel":"toc.json","_op_ogTitle":"Types (C# Programming Guide)","_op_displayDate":null,"_op_displayDate_source":null,"_op_wordCount":2331,"_op_rawTitle":"<h1 id=\"types-c-programming-guide\" sourcefile=\"docs/csharp/programming-guide/types/index.md\" sourcestartlinenumber=\"44\" sourceendlinenumber=\"44\">Types (C# Programming Guide)</h1>","_op_searchScope":[".NET"],"_op_canonicalUrl":"https://docs.microsoft.com/en-us/dotnet-all/articles/csharp/programming-guide/types/index","fileRelativePath":"articles/csharp/programming-guide/types/index.html"},"themesRelativePathToOutputRoot":"_themes/"}