{"content":"<div><div class=\"content\">\n<p><em>Classes</em> are the most fundamental of C#’s types. A class is a data structure that combines state (fields) and actions (methods and other function members) in a single unit. A class provides a definition for dynamically created <em>instances</em> of the class, also known as <em>objects</em>. Classes support <em>inheritance</em> and <em>polymorphism</em>, mechanisms whereby <em>derived classes</em> can extend and specialize <em>base classes</em>.</p>\n<p>New classes are created using class declarations. A class declaration starts with a header that specifies the attributes and modifiers of the class, the name of the class, the base class (if given), and the interfaces implemented by the class. The header is followed by the class body, which consists of a list of member declarations written between the delimiters <code>{</code> and <code>}</code>.</p>\n<p>The following is a declaration of a simple class named <code>Point</code>:</p>\n<pre><code class=\"lang-csharp\" name=\"PointClass\">public class Point\n{\n    public int x, y;\n    public Point(int x, int y) \n    {\n        this.x = x;\n        this.y = y;\n    }\n}\n</code></pre><p>Instances of classes are created using the <code>new</code> operator, which allocates memory for a new instance, invokes a constructor to initialize the instance, and returns a reference to the instance. The following statements create two Point objects and store references to those objects in two variables:</p>\n<pre><code class=\"lang-csharp\" name=\"PointExample\">Point p1 = new Point(0, 0);\nPoint p2 = new Point(10, 20);\n</code></pre><p>The memory occupied by an object is automatically reclaimed when the object is no longer reachable. It is neither necessary nor possible to explicitly deallocate objects in C#.</p>\n<h2 id=\"members\">Members</h2>\n<p>The members of a class are either static members or instance members. Static members belong to classes, and instance members belong to objects (instances of classes).</p>\n<p>The following provides an overview of the kinds of members a class can contain.</p>\n<ul>\n<li>Constants<ul>\n<li>Constant values associated with the class</li>\n</ul>\n</li>\n<li>Fields<ul>\n<li>Variables of the class</li>\n</ul>\n</li>\n<li>Methods<ul>\n<li>Computations and actions that can be performed by the class</li>\n</ul>\n</li>\n<li>Properties<ul>\n<li>Actions associated with reading and writing named properties of the class</li>\n</ul>\n</li>\n<li>Indexers<ul>\n<li>Actions associated with indexing instances of the class like an array</li>\n</ul>\n</li>\n<li>Events<ul>\n<li>Notifications that can be generated by the class</li>\n</ul>\n</li>\n<li>Operators<ul>\n<li>Conversions and expression operators supported by the class</li>\n</ul>\n</li>\n<li>Constructors<ul>\n<li>Actions required to initialize instances of the class or the class itself</li>\n</ul>\n</li>\n<li>Finalizers<ul>\n<li>Actions to perform before instances of the class are permanently discarded</li>\n</ul>\n</li>\n<li>Types<ul>\n<li>Nested types declared by the class</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"accessibility\">Accessibility</h2>\n<p>Each member of a class has an associated accessibility, which controls the regions of program text that are able to access the member. There are five possible forms of accessibility. These are summarized below.</p>\n<ul>\n<li><code>public</code><ul>\n<li>Access not limited</li>\n</ul>\n</li>\n<li><code>protected</code><ul>\n<li>Access limited to this class or classes derived from this class</li>\n</ul>\n</li>\n<li><code>internal</code><ul>\n<li>Access limited to this program</li>\n</ul>\n</li>\n<li><code>protected internal</code><ul>\n<li>Access limited to this program or classes derived from this class</li>\n</ul>\n</li>\n<li><code>private</code><ul>\n<li>Access limited to this class</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"type-parameters\">Type parameters</h2>\n<p>A class definition may specify a set of type parameters by following the class name with angle brackets enclosing a list of type parameter names. The type parameters can then be used in the body of the class declarations to define the members of the class. In the following example, the type parameters of <code>Pair</code> are <code>TFirst</code> and <code>TSecond</code>:</p>\n<pre><code class=\"lang-csharp\" name=\"Pair\">public class Pair&lt;TFirst,TSecond&gt;\n{\n    public TFirst First;\n    public TSecond Second;\n}\n</code></pre><p>A class type that is declared to take type parameters is called a <em>generic class type</em>. Struct, interface and delegate types can also be generic.\nWhen the generic class is used, type arguments must be provided for each of the type parameters:</p>\n<pre><code class=\"lang-csharp\" name=\"PairExample\">Pair&lt;int,string&gt; pair = new Pair&lt;int,string&gt; { First = 1, Second = &quot;two&quot; };\nint i = pair.First;     // TFirst is int\nstring s = pair.Second; // TSecond is string\n</code></pre><p>A generic type with type arguments provided, like <code>Pair&lt;int,string&gt;</code> above, is called a <em>constructed type</em>.</p>\n<h2 id=\"base-classes\">Base classes</h2>\n<p>A class declaration may specify a base class by following the class name and type parameters with a colon and the name of the base class. Omitting a base class specification is the same as deriving from type object. In the following example, the base class of <code>Point3D</code> is <code>Point</code>, and the base class of <code>Point</code> is <code>object</code>:</p>\n<pre><code class=\"lang-csharp\" name=\"Point3DClass\">public class Point\n{\n    public int x, y;\n    public Point(int x, int y) \n    {\n        this.x = x;\n        this.y = y;\n    }\n}\npublic class Point3D: Point\n{\n    public int z;\n    public Point3D(int x, int y, int z) : \n        base(x, y) \n    {\n        this.z = z;\n    }\n}\n</code></pre><p>A class inherits the members of its base class. Inheritance means that a class implicitly contains all members of its base class, except for the instance and static constructors, and the finalizers of the base class. A derived class can add new members to those it inherits, but it cannot remove the definition of an inherited member. In the previous example, <code>Point3D</code> inherits the <code>x</code> and <code>y</code> fields from <code>Point</code>, and every <code>Point3D</code> instance contains three fields, <code>x</code>, <code>y</code>, and <code>z</code>.</p>\n<p>An implicit conversion exists from a class type to any of its base class types. Therefore, a variable of a class type can reference an instance of that class or an instance of any derived class. For example, given the previous class declarations, a variable of type <code>Point</code> can reference either a <code>Point</code> or a <code>Point3D</code>:</p>\n<pre><code class=\"lang-csharp\" name=\"Point3DExample\">Point a = new Point(10, 20);\nPoint b = new Point3D(10, 20, 30);\n</code></pre><h2 id=\"fields\">Fields</h2>\n<p>A <em>field</em> is a variable that is associated with a class or with an instance of a class.</p>\n<p>A field declared with the static modifier defines a static field. A static field identifies exactly one storage location. No matter how many instances of a class are created, there is only ever one copy of a static field.</p>\n<p>A field declared without the static modifier defines an instance field. Every instance of a class contains a separate copy of all the instance fields of that class.</p>\n<p>In the following example, each instance of the <code>Color</code> class has a separate copy of the <code>r</code>, <code>g</code>, and <code>b</code> instance fields, but there is only one copy of the <code>Black</code>, <code>White</code>, <code>Red</code>, <code>Green</code>, and <code>Blue</code> static fields:</p>\n<pre><code class=\"lang-csharp\" name=\"ColorClass\">public class Color\n{\n    public static readonly Color Black = new Color(0, 0, 0);\n    public static readonly Color White = new Color(255, 255, 255);\n    public static readonly Color Red = new Color(255, 0, 0);\n    public static readonly Color Green = new Color(0, 255, 0);\n    public static readonly Color Blue = new Color(0, 0, 255);\n    private byte r, g, b;\n    public Color(byte r, byte g, byte b) \n    {\n        this.r = r;\n        this.g = g;\n        this.b = b;\n    }\n}\n</code></pre><p>As shown in the previous example, <em>read-only fields</em> may be declared with a <code>readonly</code> modifier. Assignment to a <code>readonly</code> field can only occur as part of the field’s declaration or in a constructor in the same class.</p>\n<h2 id=\"methods\">Methods</h2>\n<p>A <em>method</em> is a member that implements a computation or action that can be performed by an object or class. <em>Static methods</em> are accessed through the class. <em>Instance methods</em> are accessed through instances of the class.</p>\n<p>Methods may have a list of <em>parameters</em>, which represent values or variable references passed to the method, and a <em>return type</em>, which specifies the type of the value computed and returned by the method. A method’s return type is <code>void</code> if it does not return a value.</p>\n<p>Like types, methods may also have a set of type parameters, for which type arguments must be specified when the method is called. Unlike types, the type arguments can often be inferred from the arguments of a method call and need not be explicitly given.</p>\n<p>The <em>signature</em> of a method must be unique in the class in which the method is declared. The signature of a method consists of the name of the method, the number of type parameters and the number, modifiers, and types of its parameters. The signature of a method does not include the return type.</p>\n<h3 id=\"parameters\">Parameters</h3>\n<p>Parameters are used to pass values or variable references to methods. The parameters of a method get their actual values from the <em>arguments</em> that are specified when the method is invoked. There are four kinds of parameters: value parameters, reference parameters, output parameters, and parameter arrays.</p>\n<p>A <em>value parameter</em> is used for input parameter passing. A value parameter corresponds to a local variable that gets its initial value from the argument that was passed for the parameter. Modifications to a value parameter do not affect the argument that was passed for the parameter. </p>\n<p>Value parameters can be optional, by specifying a default value so that corresponding arguments can be omitted.</p>\n<p>A <em>reference parameter</em> is used for both input and output parameter passing. The argument passed for a reference parameter must be a variable, and during execution of the method, the reference parameter represents the same storage location as the argument variable. A reference parameter is declared with the <code>ref</code> modifier. The following example shows the use of <code>ref</code> parameters.</p>\n<pre><code class=\"lang-csharp\" name=\"swapExample\">using System;\nclass RefExample\n{\n    static void Swap(ref int x, ref int y) \n    {\n        int temp = x;\n        x = y;\n        y = temp;\n    }\n    public static void SwapExample() \n    {\n        int i = 1, j = 2;\n        Swap(ref i, ref j);\n        Console.WriteLine($&quot;{i} {j}&quot;);    // Outputs &quot;2 1&quot;\n    }\n}\n</code></pre><p>An <em>output parameter</em> is used for output parameter passing. An output parameter is similar to a reference parameter except that the initial value of the caller-provided argument is unimportant. An output parameter is declared with the <code>out</code> modifier. The following example shows the use of <code>out</code> parameters.</p>\n<pre><code class=\"lang-csharp\" name=\"OutExample\">using System;\nclass OutExample\n{\n    static void Divide(int x, int y, out int result, out int remainder) \n    {\n        result = x / y;\n        remainder = x % y;\n    }\n    public static void OutUsage() \n    {\n        int res, rem;\n        Divide(10, 3, out res, out rem);\n        Console.WriteLine(&quot;{0} {1}&quot;, res, rem);\t// Outputs &quot;3 1&quot;\n    }\n}\n</code></pre><p>A <em>parameter array</em> permits a variable number of arguments to be passed to a method. A parameter array is declared with the <code>params</code> modifier. Only the last parameter of a method can be a parameter array, and the type of a parameter array must be a single-dimensional array type. The Write and WriteLine methods of the <code>@System.Console</code> class are good examples of parameter array usage. They are declared as follows.</p>\n<pre><code class=\"lang-csharp\" name=\"ConsoleExample\">public class Console\n{\n    public static void Write(string fmt, params object[] args) { }\n    public static void WriteLine(string fmt, params object[] args) { }\n    // ...\n}\n</code></pre><p>Within a method that uses a parameter array, the parameter array behaves exactly like a regular parameter of an array type. However, in an invocation of a method with a parameter array, it is possible to pass either a single argument of the parameter array type or any number of arguments of the element type of the parameter array. In the latter case, an array instance is automatically created and initialized with the given arguments. This example</p>\n<pre><code class=\"lang-csharp\" name=\"StringFormat\">Console.WriteLine(&quot;x={0} y={1} z={2}&quot;, x, y, z);\n</code></pre><p>is equivalent to writing the following.</p>\n<pre><code class=\"lang-csharp\" name=\"StringFormat2\">string s = &quot;x={0} y={1} z={2}&quot;;\nobject[] args = new object[3];\nargs[0] = x;\nargs[1] = y;\nargs[2] = z;\nConsole.WriteLine(s, args);\n</code></pre><h3 id=\"method-body-and-local-variables\">Method body and local variables</h3>\n<p>A method’s body specifies the statements to execute when the method is invoked.</p>\n<p>A method body can declare variables that are specific to the invocation of the method. Such variables are called <em>local variables</em>. A local variable declaration specifies a type name, a variable name, and possibly an initial value. The following example declares a local variable <code>i</code> with an initial value of zero and a local variable <code>j</code> with no initial value.</p>\n<pre><code class=\"lang-csharp\" name=\"Squares\">using System;\nclass Squares\n{\n    public static void WriteSquares() \n    {\n        int i = 0;\n        int j;\n        while (i &lt; 10) \n        {\n            j = i * i;\n            Console.WriteLine($&quot;{i} x {i} = {j}&quot;);\n            i = i + 1;\n        }\n    }\n}\n</code></pre><p>C# requires a local variable to be <em>definitely assigned</em> before its value can be obtained. For example, if the declaration of the previous <code>i</code> did not include an initial value, the compiler would report an error for the subsequent usages of <code>i</code> because <code>i</code> would not be definitely assigned at those points in the program.</p>\n<p>A method can use <code>return</code> statements to return control to its caller. In a method returning <code>void</code>, <code>return</code> statements cannot specify an expression. In a method returning non-void, <code>return</code> statements must include an expression that computes the return value.</p>\n<h3 id=\"static-and-instance-methods\">Static and instance methods</h3>\n<p>A method declared with a static modifier is a <em>static method</em>. A static method does not operate on a specific instance and can only directly access static members.</p>\n<p>A method declared without a static modifier is an <em>instance method</em>. An instance method operates on a specific instance and can access both static and instance members. The instance on which an instance method was invoked can be explicitly accessed as <code>this</code>. It is an error to refer to <code>this</code> in a static method.</p>\n<p>The following <code>Entity</code> class has both static and instance members.</p>\n<pre><code class=\"lang-csharp\" name=\"Entity\">class Entity\n{\n    static int nextSerialNo;\n    int serialNo;\n    public Entity() \n    {\n        serialNo = nextSerialNo++;\n    }\n    public int GetSerialNo() \n    {\n        return serialNo;\n    }\n    public static int GetNextSerialNo() \n    {\n        return nextSerialNo;\n    }\n    public static void SetNextSerialNo(int value) \n    {\n        nextSerialNo = value;\n    }\n}\n</code></pre><p>Each <code>Entity</code> instance contains a serial number (and presumably some other information that is not shown here). The <code>Entity</code> constructor (which is like an instance method) initializes the new instance with the next available serial number. Because the constructor is an instance member, it is permitted to access both the <code>serialNo</code> instance field and the <code>nextSerialNo</code> static field.</p>\n<p>The <code>GetNextSerialNo</code> and <code>SetNextSerialNo</code> static methods can access the <code>nextSerialNo</code> static field, but it would be an error for them to directly access the <code>serialNo</code> instance field.</p>\n<p>The following example shows the use of the Entity class.</p>\n<pre><code class=\"lang-csharp\" name=\"EntityExample\">using System;\nclass EntityExample\n{\n    public static void Usage() \n    {\n        Entity.SetNextSerialNo(1000);\n        Entity e1 = new Entity();\n        Entity e2 = new Entity();\n        Console.WriteLine(e1.GetSerialNo());            // Outputs &quot;1000&quot;\n        Console.WriteLine(e2.GetSerialNo());            // Outputs &quot;1001&quot;\n        Console.WriteLine(Entity.GetNextSerialNo());    // Outputs &quot;1002&quot;\n    }\n}\n</code></pre><p>Note that the <code>SetNextSerialNo</code> and <code>GetNextSerialNo</code> static methods are invoked on the class whereas the <code>GetSerialNo</code> instance method is invoked on instances of the class.</p>\n<h3 id=\"virtual-override-and-abstract-methods\">Virtual, override, and abstract methods</h3>\n<p>When an instance method declaration includes a <code>virtual</code> modifier, the method is said to be a <em>virtual method</em>. When no virtual modifier is present, the method is said to be a <em>nonvirtual method</em>.</p>\n<p>When a virtual method is invoked, the <em>run-time type</em> of the instance for which that invocation takes place determines the actual method implementation to invoke. In a nonvirtual method invocation, the <em>compile-time type</em> of the instance is the determining factor.</p>\n<p>A virtual method can be <em>overridden</em> in a derived class. When an instance method declaration includes an override modifier, the method overrides an inherited virtual method with the same signature. Whereas a virtual method declaration introduces a new method, an override method declaration specializes an existing inherited virtual method by providing a new implementation of that method.</p>\n<p>An <em>abstract method</em> is a virtual method with no implementation. An abstract method is declared with the abstract modifier and is permitted only in a class that is also declared abstract. An abstract method must be overridden in every non-abstract derived class.</p>\n<p>The following example declares an abstract class, <code>Expression</code>, which represents an expression tree node, and three derived classes, <code>Constant</code>, <code>VariableReference</code>, and <code>Operation</code>, which implement expression tree nodes for constants, variable references, and arithmetic operations. (This is similar to, but not to be confused with the expression tree types).</p>\n<pre><code class=\"lang-csharp\" name=\"ExpressionClass\">using System;\nusing System.Collections.Generic;\npublic abstract class Expression\n{\n    public abstract double Evaluate(Dictionary&lt;string,object&gt; vars);\n}\npublic class Constant: Expression\n{\n    double value;\n    public Constant(double value) \n    {\n        this.value = value;\n    }\n    public override double Evaluate(Dictionary&lt;string,object&gt; vars) \n    {\n        return value;\n    }\n}\npublic class VariableReference: Expression\n{\n    string name;\n    public VariableReference(string name) \n    {\n        this.name = name;\n    }\n    public override double Evaluate(Dictionary&lt;string,object&gt; vars) \n    {\n        object value = vars[name];\n        if (value == null) \n        {\n            throw new Exception(&quot;Unknown variable: &quot; + name);\n        }\n        return Convert.ToDouble(value);\n    }\n}\npublic class Operation: Expression\n{\n    Expression left;\n    char op;\n    Expression right;\n    public Operation(Expression left, char op, Expression right) \n    {\n        this.left = left;\n        this.op = op;\n        this.right = right;\n    }\n    public override double Evaluate(Dictionary&lt;string,object&gt; vars) \n    {\n        double x = left.Evaluate(vars);\n        double y = right.Evaluate(vars);\n        switch (op) {\n            case &#39;+&#39;: return x + y;\n            case &#39;-&#39;: return x - y;\n            case &#39;*&#39;: return x * y;\n            case &#39;/&#39;: return x / y;\n        }\n        throw new Exception(&quot;Unknown operator&quot;);\n    }\n}\n</code></pre><p>The previous four classes can be used to model arithmetic expressions. For example, using instances of these classes, the expression <code>x + 3</code> can be represented as follows.</p>\n<pre><code class=\"lang-csharp\" name=\"ExpressionExample\">Expression e = new Operation(\n    new VariableReference(&quot;x&quot;),\n    &#39;+&#39;,\n    new Constant(3));\n</code></pre><p>The <code>Evaluate</code> method of an <code>Expression</code> instance is invoked to evaluate the given expression and produce a <code>double</code> value. The method takes as an argument a @<code>Dctionary</code> that contains variable names (as keys of the entries) and values (as values of the entries). The <code>Evaluate</code> method is a <code>virtual abstract</code> method, meaning that non-abstract derived classes must override it to provide an actual implementation.</p>\n<p>A <code>Constant</code>&#39;s implementation of <code>Evaluate</code> simply returns the stored constant. A <code>VariableReference</code>&#39;s implementation looks up the variable name in the dictionary and returns the resulting value. An <code>Operation</code>&#39;s implementation first evaluates the left and right operands (by recursively invoking their <code>Evaluate</code> methods) and then performs the given arithmetic operation.</p>\n<p>The following program uses the <code>Expression</code> classes to evaluate the expression <code>x * (y + 2)</code> for different values of <code>x</code> and <code>y</code>.</p>\n<pre><code class=\"lang-csharp\" name=\"ExpressionUsage\">using System;\nusing System.Collections.Generic;\nclass InheritanceExample\n{\n    public static void ExampleUsage() \n    {\n        Expression e = new Operation(\n            new VariableReference(&quot;x&quot;),\n            &#39;*&#39;,\n            new Operation(\n                new VariableReference(&quot;y&quot;),\n                &#39;+&#39;,\n                new Constant(2)\n            )\n        );\n        Dictionary&lt;string,object&gt; vars = new Dictionary&lt;string, object&gt;();\n        vars[&quot;x&quot;] = 3;\n        vars[&quot;y&quot;] = 5;\n        Console.WriteLine(e.Evaluate(vars));\t\t// Outputs &quot;21&quot;\n        vars[&quot;x&quot;] = 1.5;\n        vars[&quot;y&quot;] = 9;\n        Console.WriteLine(e.Evaluate(vars));\t\t// Outputs &quot;16.5&quot;\n    }\n}   \n</code></pre><h3 id=\"method-overloading\">Method overloading</h3>\n<p>Method <em>overloading</em> permits multiple methods in the same class to have the same name as long as they have unique signatures. When compiling an invocation of an overloaded method, the compiler uses <em>overload resolution</em> to determine the specific method to invoke. Overload resolution finds the one method that best matches the arguments or reports an error if no single best match can be found. The following example shows overload resolution in effect. The comment for each invocation in the <code>Main</code> method shows which method is actually invoked.</p>\n<pre><code class=\"lang-csharp\" name=\"OverloadUsage\">using System;\nclass OverloadingExample\n{\n    static void F() \n    {\n        Console.WriteLine(&quot;F()&quot;);\n    }\n    static void F(object x) \n    {\n        Console.WriteLine(&quot;F(object)&quot;);\n    }\n    static void F(int x) \n    {\n        Console.WriteLine(&quot;F(int)&quot;);\n    }\n    static void F(double x) \n    {\n        Console.WriteLine(&quot;F(double)&quot;);\n    }\n    static void F&lt;T&gt;(T x) \n    {\n        Console.WriteLine(&quot;F&lt;T&gt;(T)&quot;);\n    }\n    static void F(double x, double y) \n    {\n        Console.WriteLine(&quot;F(double, double)&quot;);\n    }\n    public static void UsageExample()\n    {\n        F();            // Invokes F()\n        F(1);           // Invokes F(int)\n        F(1.0);         // Invokes F(double)\n        F(&quot;abc&quot;);       // Invokes F&lt;string&gt;(string)\n        F((double)1);   // Invokes F(double)\n        F((object)1);   // Invokes F(object)\n        F&lt;int&gt;(1);      // Invokes F&lt;int&gt;(int)\n        F(1, 1);        // Invokes F(double, double)\n    }\n}\n</code></pre><p>As shown by the example, a particular method can always be selected by explicitly casting the arguments to the exact parameter types and/or explicitly supplying type arguments.</p>\n<h2 id=\"other-function-members\">Other function members</h2>\n<p>Members that contain executable code are collectively known as the <em>function members</em> of a class. The preceding section describes methods, which are the primary kind of function members. This section describes the other kinds of function members supported by C#: constructors, properties, indexers, events, operators, and finalizers.</p>\n<p>The following shows a generic class called List<t>, which implements a growable list of objects. The class contains several examples of the most common kinds of function members.<p>\n<pre><code class=\"lang-csharp\" name=\"ListClass\">public class List&lt;T&gt;\n{\n    // Constant\n    const int defaultCapacity = 4;\n\n    // Fields\n    T[] items;\n    int count;\n\n    // Constructor\n    public List(int capacity = defaultCapacity) \n    {\n        items = new T[capacity];\n    }\n\n    // Properties\n    public int Count =&gt; count; \n\n    public int Capacity \n    {\n        get { return items.Length; }\n        set \n        {\n            if (value &lt; count) value = count;\n            if (value != items.Length) \n            {\n                T[] newItems = new T[value];\n                Array.Copy(items, 0, newItems, 0, count);\n                items = newItems;\n            }\n        }\n    }\n\n    // Indexer\n    public T this[int index] \n    {\n        get \n        {\n            return items[index];\n        }\n        set \n        {\n            items[index] = value;\n            OnChanged();\n        }\n    }\n    \n    // Methods\n    public void Add(T item) \n    {\n        if (count == Capacity) Capacity = count * 2;\n        items[count] = item;\n        count++;\n        OnChanged();\n    }\n    protected virtual void OnChanged() =&gt;\n        Changed?.Invoke(this, EventArgs.Empty);\n\n    public override bool Equals(object other) =&gt;\n        Equals(this, other as List&lt;T&gt;);\n\n    static bool Equals(List&lt;T&gt; a, List&lt;T&gt; b) \n    {\n        if (Object.ReferenceEquals(a, null)) return Object.ReferenceEquals(b, null);\n        if (Object.ReferenceEquals(b, null) || a.count != b.count)\n            return false;\n        for (int i = 0; i &lt; a.count; i++) \n        {\n            if (!object.Equals(a.items[i], b.items[i])) \n            {\n                return false;\n            }\n        }\n    return true;\n    }\n\n    // Event\n    public event EventHandler Changed;\n\n    // Operators\n    public static bool operator ==(List&lt;T&gt; a, List&lt;T&gt; b) =&gt; \n        Equals(a, b);\n\n    public static bool operator !=(List&lt;T&gt; a, List&lt;T&gt; b) =&gt; \n        !Equals(a, b);\n}\n</code></pre><h3 id=\"constructors\">Constructors</h3>\n<p>C# supports both instance and static constructors. An <em>instance constructor</em> is a member that implements the actions required to initialize an instance of a class. A <em>static constructor</em> is a member that implements the actions required to initialize a class itself when it is first loaded.</p>\n<p>A constructor is declared like a method with no return type and the same name as the containing class. If a constructor declaration includes a static modifier, it declares a static constructor. Otherwise, it declares an instance constructor.</p>\n<p>Instance constructors can be overloaded, and can have optional parameters. For example, the <code>List&lt;T&gt;</code> class declares two instance constructors, one with no parameters and one that takes an <code>int</code> parameter. Instance constructors are invoked using the <code>new</code> operator. The following statements allocate two <code>List&lt;string&gt;</code> instances using the constructor of the <code>List</code> class with and without the optional argument.</p>\n<pre><code class=\"lang-csharp\" name=\"ListExample1\">List&lt;string&gt; list1 = new List&lt;string&gt;();\nList&lt;string&gt; list2 = new List&lt;string&gt;(10);\n</code></pre><p>Unlike other members, instance constructors are not inherited, and a class has no instance constructors other than those actually declared in the class. If no instance constructor is supplied for a class, then an empty one with no parameters is automatically provided.</p>\n<h3 id=\"properties\">Properties</h3>\n<p><em>Properties</em> are a natural extension of fields. Both are named members with associated types, and the syntax for accessing fields and properties is the same. However, unlike fields, properties do not denote storage locations. Instead, properties have <em>accessors</em> that specify the statements to be executed when their values are read or written.</p>\n<p>A property is declared like a field, except that the declaration ends with a get accessor and/or a set accessor written between the delimiters <code>{</code> and <code>}</code> instead of ending in a semicolon. A property that has both a get accessor and a set accessor is a <em>read-write property</em>, a property that has only a get accessor is a <em>read-only property</em>, and a property that has only a set accessor is a <em>write-only property</em>.</p>\n<p>A get accessor corresponds to a parameterless method with a return value of the property type. Except as the target of an assignment, when a property is referenced in an expression, the get accessor of the property is invoked to compute the value of the property.</p>\n<p>A set accessor corresponds to a method with a single parameter named value and no return type. When a property is referenced as the target of an assignment or as the operand of ++ or --, the set accessor is invoked with an argument that provides the new value.</p>\n<p>The <code>List&lt;T&gt;</code> class declares two properties, Count and Capacity, which are read-only and read-write, respectively. The following is an example of use of these properties.</p>\n<pre><code class=\"lang-csharp\" name=\"ListExample2\">List&lt;string&gt; names = new List&lt;string&gt;();\nnames.Capacity = 100;   // Invokes set accessor\nint i = names.Count;    // Invokes get accessor\nint j = names.Capacity; // Invokes get accessor\n</code></pre><p>Similar to fields and methods, C# supports both instance properties and static properties. Static properties are declared with the static modifier, and instance properties are declared without it.</p>\n<p>The accessor(s) of a property can be virtual. When a property declaration includes a <code>virtual</code>, <code>abstract</code>, or <code>override</code> modifier, it applies to the accessor(s) of the property.</p>\n<h3 id=\"indexers\">Indexers</h3>\n<p>An <em>indexer</em> is a member that enables objects to be indexed in the same way as an array. An indexer is declared like a property except that the name of the member is this followed by a parameter list written between the delimiters <code>[</code> and <code>]</code>. The parameters are available in the accessor(s) of the indexer. Similar to properties, indexers can be read-write, read-only, and write-only, and the accessor(s) of an indexer can be virtual.</p>\n<p>The <code>List</code> class declares a single read-write indexer that takes an <code>int</code> parameter. The indexer makes it possible to index <code>List</code> instances with <code>int</code> values. For example:</p>\n<pre><code class=\"lang-csharp\" name=\"ListExample3\">List&lt;string&gt; names = new List&lt;string&gt;();\nnames.Add(&quot;Liz&quot;);\nnames.Add(&quot;Martha&quot;);\nnames.Add(&quot;Beth&quot;);\nfor (int i = 0; i &lt; names.Count; i++) \n{\n    string s = names[i];\n    names[i] = s.ToUpper();\n}\n</code></pre><p>Indexers can be overloaded, meaning that a class can declare multiple indexers as long as the number or types of their parameters differ.</p>\n<h3 id=\"events\">Events</h3>\n<p>An <em>event</em> is a member that enables a class or object to provide notifications. An event is declared like a field except that the declaration includes an event keyword and the type must be a delegate type.</p>\n<p>Within a class that declares an event member, the event behaves just like a field of a delegate type (provided the event is not abstract and does not declare accessors). The field stores a reference to a delegate that represents the event handlers that have been added to the event. If no event handlers are present, the field is <code>null</code>.</p>\n<p>The <code>List&lt;T&gt;</code> class declares a single event member called <code>Changed</code>, which indicates that a new item has been added to the list. The Changed event is raised by the <code>OnChanged</code> virtual method, which first checks whether the event is <code>null</code> (meaning that no handlers are present). The notion of raising an event is precisely equivalent to invoking the delegate represented by the event—thus, there are no special language constructs for raising events.</p>\n<p>Clients react to events through <em>event handlers</em>. Event handlers are attached using the <code>+=</code> operator and removed using the <code>-=</code> operator. The following example attaches an event handler to the <code>Changed</code> event of a <code>List&lt;string&gt;</code>.</p>\n<pre><code class=\"lang-csharp\" name=\"EventExample\">class EventExample\n{\n    static int changeCount;\n    static void ListChanged(object sender, EventArgs e) \n    {\n        changeCount++;\n    }\n    public static void Usage() \n    {\n        List&lt;string&gt; names = new List&lt;string&gt;();\n        names.Changed += new EventHandler(ListChanged);\n        names.Add(&quot;Liz&quot;);\n        names.Add(&quot;Martha&quot;);\n        names.Add(&quot;Beth&quot;);\n        Console.WriteLine(changeCount);\t\t// Outputs &quot;3&quot;\n    }\n}\n</code></pre><p>For advanced scenarios where control of the underlying storage of an event is desired, an event declaration can explicitly provide <code>add</code> and <code>remove</code> accessors, which are somewhat similar to the <code>set</code> accessor of a property.</p>\n<h3 id=\"operators\">Operators</h3>\n<p>An <em>operator</em> is a member that defines the meaning of applying a particular expression operator to instances of a class. Three kinds of operators can be defined: unary operators, binary operators, and conversion operators. All operators must be declared as <code>public</code> and <code>static</code>.</p>\n<p>The <code>List&lt;T&gt;</code> class declares two operators, <code>operator ==</code> and <code>operator !=</code>, and thus gives new meaning to expressions that apply those operators to <code>List</code> instances. Specifically, the operators define equality of two <code>List&lt;T&gt;</code> instances as comparing each of the contained objects using their Equals methods. The following example uses the <code>==</code> operator to compare two <code>List&lt;int&gt;</code> instances.</p>\n<pre><code class=\"lang-csharp\" name=\"OperatorExample\">List&lt;int&gt; a = new List&lt;int&gt;();\na.Add(1);\na.Add(2);\nList&lt;int&gt; b = new List&lt;int&gt;();\nb.Add(1);\nb.Add(2);\nConsole.WriteLine(a == b);  // Outputs &quot;True&quot; \nb.Add(3);\nConsole.WriteLine(a == b);  // Outputs &quot;False&quot;\n</code></pre><p>The first <code>Console.WriteLine</code> outputs <code>True</code> because the two lists contain the same number of objects with the same values in the same order. Had <code>List&lt;T&gt;</code> not defined <code>operator ==</code>, the first <code>Console.WriteLine</code> would have output <code>False</code> because <code>a</code> and <code>b</code> reference different <code>List&lt;int&gt;</code> instances.</p>\n<h3 id=\"finalizers\">Finalizers</h3>\n<p>A <em>finalizer</em> is a member that implements the actions required to finalize an instance of a class. Finalizers cannot have parameters, they cannot have accessibility modifiers, and they cannot be invoked explicitly. The finalizer for an instance is invoked automatically during garbage collection.</p>\n<p>The garbage collector is allowed wide latitude in deciding when to collect objects and run finalizers. Specifically, the timing of finalizer invocations is not deterministic, and finalizers may be executed on any thread. For these and other reasons, classes should implement finalizers only when no other solutions are feasible.</p>\n<p>The <code>using</code> statement provides a better approach to object destruction.</p>\n<div class=\"step-by-step\"><p><a href=\"statements\" data-linktype=\"relative-path\">Previous</a>\n<a href=\"structs\" data-linktype=\"relative-path\">Next</a></p>\n</div>\n</t></div></div>","outputRootRelativePath":"../../../","pageMetadata":"<meta name=\"author\" content=\"BillWagner\">\r\n<meta name=\"ms.author\" content=\"wiwagn\">\r\n<meta name=\"manager\" content=\"wpickett\">\r\n<meta name=\"breadcrumb_path\" content=\"/dotnet-internal/toc.json\">\r\n<meta name=\"ms.devlang\" content=\"csharp\">\r\n<meta name=\"ms.assetid\" content=\"63a89bde-0f05-4bc4-b0cd-4f693854f0cd\">\r\n<meta name=\"description\" content=\"New to C#? Read this overview of classes, objects and inheritance\">\r\n<meta name=\"keywords\" content=\".NET, csharp, class, instance, object, inheritance, polymorphism\">\r\n<meta name=\"ms.topic\" content=\"article\">\r\n<meta name=\"ms.date\" content=\"08/10/2016\">\r\n<meta name=\"ms.technology\" content=\"devlang-csharp\">\r\n<meta name=\"ms.prod\" content=\".net\">\r\n<meta name=\"search.ms_sitename\" content=\"Docs\">\r\n<meta name=\"search.ms_docsetname\" content=\"docs-internal\">\r\n<meta name=\"version\" content=\"0\">\r\n<meta name=\"locale\" content=\"en-us\">\r\n<meta name=\"site_name\" content=\"Docs\">\r\n<meta name=\"search.ms_product\" content=\"MSDN\">\r\n<meta name=\"depot_name\" content=\"MSDN.docs-internal\">\r\n<meta name=\"updated_at\" content=\"2017-03-21 01:42 AM\">\r\n<meta name=\"gitcommit\" content=\"https://github.com/dotnet/docs-internal/blob/d55bd0671c05c738e8df78f95552b8dce6af03a4/docs/csharp/tour-of-csharp/classes-and-objects.md\">\r\n<meta name=\"original_content_git_url\" content=\"https://github.com/dotnet/docs-internal/blob/tianzhXamarin/docs/csharp/tour-of-csharp/classes-and-objects.md\">\r\n<meta name=\"document_id\" content=\"941c444c-461c-3060-a5c6-471176aa41e9\">\r\n<meta name=\"pagetype\" content=\"Conceptual\">\r\n<meta name=\"toc_rel\" content=\"toc.json\">\r\n","rawMetadata":{"author":"BillWagner","ms.author":"wiwagn","manager":"wpickett","breadcrumb_path":"/dotnet-internal/toc.json","title":"Classes and Objects in C# | Microsoft Docs","ms.devlang":"csharp","ms.assetid":"63a89bde-0f05-4bc4-b0cd-4f693854f0cd","description":"New to C#? Read this overview of classes, objects and inheritance","keywords":".NET, csharp, class, instance, object, inheritance, polymorphism","ms.topic":"article","ms.date":"08/10/2016","ms.technology":"devlang-csharp","ms.prod":".net","search.ms_sitename":"Docs","search.ms_docsetname":"docs-internal","version":0,"_op_canonicalUrlPrefix":"https://docs.microsoft.com/en-us/dotnet-internal/","locale":"en-us","site_name":"Docs","search.ms_product":"MSDN","_op_openToPublicContributors":false,"depot_name":"MSDN.docs-internal","_op_gitCommitHistory":[{"author_name":"Bill Wagner","author_email":"wiwagn@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"Fix date format to be mm/dd/yyyy (#1360)","commit_sha":"d55bd0671c05c738e8df78f95552b8dce6af03a4","commit_date":"2016-12-27 12:57:27 -0500"},{"author_name":"Maira Wenzel","author_email":"mairaw@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"Metadata updates (#1313)","commit_sha":"90fe68f7f3c4b46502b5d3770b1a2d57c6af748a","commit_date":"2016-12-09 12:40:41 -0800"},{"author_name":"Bader Nasser","author_email":"badersur@users.noreply.github.com","committer_name":"Maira Wenzel","comitter_email":"mairaw@microsoft.com","message":"Update classes-and-objects.md (#1078)","commit_sha":"020bcdffbc8bb58274412b6b1e78d3f965efdf76","commit_date":"2016-09-26 10:52:41 -0700"},{"author_name":"Bill Wagner","author_email":"wiwagn@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"Tour of csharp (#893)","commit_sha":"487f9831526f124ddd60dece21852da8c086b520","commit_date":"2016-08-23 10:20:56 -0400"}],"updated_at":"2017-03-21 01:42 AM","_op_gitContributorInformation":{"author":{"profile_url":"https://github.com/BillWagner","display_name":"Bill Wagner","id":"493969"},"contributors":[{"profile_url":"https://github.com/BillWagner","display_name":"Bill Wagner"},{"profile_url":"https://github.com/mairaw","display_name":"Maira Wenzel","id":"12971179"},{"profile_url":"https://github.com/badersur","display_name":"Bader Nasser","id":"1686391"}],"update_at":"3/21/2017"},"gitcommit":"https://github.com/dotnet/docs-internal/blob/d55bd0671c05c738e8df78f95552b8dce6af03a4/docs/csharp/tour-of-csharp/classes-and-objects.md","original_content_git_url":"https://github.com/dotnet/docs-internal/blob/tianzhXamarin/docs/csharp/tour-of-csharp/classes-and-objects.md","open_to_public_contributors":false,"content_git_url":"https://github.com/dotnet/docs/blob/master/docs/csharp/tour-of-csharp/classes-and-objects.md","document_id":"941c444c-461c-3060-a5c6-471176aa41e9","layout":"Conceptual","pagetype":"Conceptual","canonical_url":"https://docs.microsoft.com/en-us/dotnet-all/articles/csharp/tour-of-csharp/classes-and-objects","toc_asset_id":"articles/csharp/tour-of-csharp/toc.json","toc_rel":"toc.json","_op_ogTitle":"Classes and Objects in C#","_op_displayDate":"2016-8-10","_op_displayDate_source":"2016-08-10T00:00:00Z","_op_wordCount":4659,"_op_rawTitle":"<h1 id=\"classes-and-objects\" sourcefile=\"docs/csharp/tour-of-csharp/classes-and-objects.md\" sourcestartlinenumber=\"14\" sourceendlinenumber=\"14\">Classes and objects</h1>","_op_searchScope":[".NET"],"_op_canonicalUrl":"https://docs.microsoft.com/en-us/dotnet-all/articles/csharp/tour-of-csharp/classes-and-objects","fileRelativePath":"articles/csharp/tour-of-csharp/classes-and-objects.html"},"themesRelativePathToOutputRoot":"_themes/"}