{"content":"<div><div class=\"content\">\n<p>This topic contains the following sections that explore the common type system in depth:</p>\n<ul>\n<li><p><a href=\"#types-in-net\" data-linktype=\"self-bookmark\">Types in .NET</a></p>\n</li>\n<li><p><a href=\"#type-definitions\" data-linktype=\"self-bookmark\">Type definitions</a></p>\n</li>\n<li><p><a href=\"#type-members\" data-linktype=\"self-bookmark\">Type members</a></p>\n</li>\n<li><p><a href=\"#characteristics-of-type-members\" data-linktype=\"self-bookmark\">Characteristics of type members</a></p>\n</li>\n</ul>\n<h2 id=\"types-in-net\">Types in .NET</h2>\n<p>All types in .NET are either value types or reference types. </p>\n<p>Value types are data types whose objects are represented by the object&#39;s actual value. If an instance of a value type is assigned to a variable, that variable is given a fresh copy of the value.</p>\n<p>Reference types are data types whose objects are represented by a reference (similar to a pointer) to the object&#39;s actual value. If a reference type is assigned to a variable, that variable references (points to) the original value. No copy is made. </p>\n<p>The common type system in .NET supports the following five categories of types:</p>\n<ul>\n<li><p><a href=\"#classes\" data-linktype=\"self-bookmark\">Classes</a></p>\n</li>\n<li><p><a href=\"#structures\" data-linktype=\"self-bookmark\">Structures</a></p>\n</li>\n<li><p><a href=\"#enumerations\" data-linktype=\"self-bookmark\">Enumerations</a></p>\n</li>\n<li><p><a href=\"#interfaces\" data-linktype=\"self-bookmark\">Interfaces</a></p>\n</li>\n<li><p><a href=\"#delegates\" data-linktype=\"self-bookmark\">Delegates</a></p>\n</li>\n</ul>\n<h3 id=\"classes\">Classes</h3>\n<p>A class is a reference type that can be derived directly from another class and that is derived implicitly from <a class=\"xref\" href=\"../../../api/system.object\" data-linktype=\"relative-path\">System.Object</a>. The class defines the operations that an object (which is an instance of the class) can perform (methods, events, or properties) and the data that the object contains (fields). Although a class generally includes both definition and implementation (unlike interfaces, for example, which contain only definition without implementation), it can have one or more members that have no implementation.</p>\n<p>The following table describes some of the characteristics that a class may have. Each language that supports the runtime provides a way to indicate that a class or class member has one or more of these characteristics. However, individual programming languages that target .NET may not make all these characteristics available.</p>\n<table>\n<thead>\n<tr>\n<th>Characteristic</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>sealed</td>\n<td>Specifies that another class cannot be derived from this type.</td>\n</tr>\n<tr>\n<td>implements</td>\n<td>Indicates that the class uses one or more interfaces by providing implementations of interface members.</td>\n</tr>\n<tr>\n<td>abstract</td>\n<td>Indicates that the class cannot be instantiated. To use it, you must derive another class from it.</td>\n</tr>\n<tr>\n<td>inherits</td>\n<td>Indicates that instances of the class can be used anywhere the base class is specified. A derived class that inherits from a base class can use the implementation of any public members provided by the base class, or the derived class can override the implementation of the public members with its own implementation.</td>\n</tr>\n<tr>\n<td>exported or not exported</td>\n<td>Indicates whether a class is visible outside the assembly in which it is defined. This characteristic applies only to top-level classes and not to nested classes.</td>\n</tr>\n</tbody>\n</table>\n<div class=\"NOTE\"><h5>Note</h5><p>A class can also be nested in a parent class or structure. Nested classes also have member characteristics. For more information, see <a href=\"#nested-types\" data-linktype=\"self-bookmark\">Nested types</a>.</p>\n</div>\n<p>Class members that have no implementation are abstract members. A class that has one or more abstract members is itself abstract; new instances of it cannot be created. Some languages that target the runtime let you mark a class as abstract even if none of its members are abstract. You can use an abstract class when you want to encapsulate a basic set of functionality that derived classes can inherit or override when appropriate. Classes that are not abstract are referred to as concrete classes.</p>\n<p>A class can implement any number of interfaces, but it can inherit from only one base class in addition to <a class=\"xref\" href=\"../../../api/system.object\" data-linktype=\"relative-path\">System.Object</a>, from which all classes inherit implicitly. All classes must have at least one constructor, which initializes new instances of the class. If you do not explicitly define a constructor, most compilers will automatically provide a default (parameterless) constructor.</p>\n<h3 id=\"structures\">Structures</h3>\n<p>A structure is a value type that derives implicitly from <a class=\"xref\" href=\"../../../api/system.valuetype\" data-linktype=\"relative-path\">System.ValueType</a>, which in turn is derived from <a class=\"xref\" href=\"../../../api/system.object\" data-linktype=\"relative-path\">System.Object</a>. A structure is very useful for representing values whose memory requirements are small, and for passing values as by-value parameters to methods that have strongly typed parameters. In .NET, all primitive data types (<a class=\"xref\" href=\"../../../api/system.boolean\" data-linktype=\"relative-path\">Boolean</a>, <a class=\"xref\" href=\"../../../api/system.byte\" data-linktype=\"relative-path\">Byte</a>, <a class=\"xref\" href=\"../../../api/system.char\" data-linktype=\"relative-path\">Char</a>, <a class=\"xref\" href=\"../../../api/system.datetime\" data-linktype=\"relative-path\">DateTime</a>, <a class=\"xref\" href=\"../../../api/system.decimal\" data-linktype=\"relative-path\">Decimal</a>, <a class=\"xref\" href=\"../../../api/system.double\" data-linktype=\"relative-path\">Double</a>, <a class=\"xref\" href=\"../../../api/system.int16\" data-linktype=\"relative-path\">Int16</a>, <a class=\"xref\" href=\"../../../api/system.int32\" data-linktype=\"relative-path\">Int32</a>, <a class=\"xref\" href=\"../../../api/system.int64\" data-linktype=\"relative-path\">Int64</a>, <a class=\"xref\" href=\"../../../api/system.sbyte\" data-linktype=\"relative-path\">SByte</a>, <a class=\"xref\" href=\"../../../api/system.single\" data-linktype=\"relative-path\">Single</a>, <a class=\"xref\" href=\"../../../api/system.uint16\" data-linktype=\"relative-path\">UInt16</a>, <a class=\"xref\" href=\"../../../api/system.uint32\" data-linktype=\"relative-path\">UInt32</a>, and <a class=\"xref\" href=\"../../../api/system.uint64\" data-linktype=\"relative-path\">UInt64</a>) are defined as structures.</p>\n<p>Like classes, structures define both data (the fields of the structure) and the operations that can be performed on that data (the methods of the structure). This means that you can call methods on structures, including the virtual methods defined on the <a class=\"xref\" href=\"../../../api/system.object\" data-linktype=\"relative-path\">System.Object</a> and <a class=\"xref\" href=\"../../../api/system.valuetype\" data-linktype=\"relative-path\">System.ValueType</a> classes, and any methods defined on the value type itself. In other words, structures can have fields, properties, and events, as well as static and nonstatic methods. You can create instances of structures, pass them as parameters, store them as local variables, or store them in a field of another value type or reference type. Structures can also implement interfaces.</p>\n<p>Value types also differ from classes in several respects. First, although they implicitly inherit from <a class=\"xref\" href=\"../../../api/system.valuetype\" data-linktype=\"relative-path\">System.ValueType</a>, they cannot directly inherit from any type. Similarly, all value types are sealed, which means that no other type can be derived from them. They also do not require constructors.</p>\n<p>For each value type, the common language runtime supplies a corresponding boxed type, which is a class that has the same state and behavior as the value type. An instance of a value type is boxed when it is passed to a method that accepts a parameter of type <a class=\"xref\" href=\"../../../api/system.object\" data-linktype=\"relative-path\">System.Object</a>. It is unboxed (that is, converted from an instance of a class back to an instance of a value type) when control returns from a method call that accepts a value type as a by-reference parameter. Some languages require that you use special syntax when the boxed type is required; others automatically use the boxed type when it is needed. When you define a value type, you are defining both the boxed and the unboxed type.</p>\n<h3 id=\"enumerations\">Enumerations</h3>\n<p>An enumeration (enum) is a value type that inherits directly from <a class=\"xref\" href=\"../../../api/system.enum\" data-linktype=\"relative-path\">System.Enum</a> and that supplies alternate names for the values of an underlying primitive type. An enumeration type has a name, an underlying type that must be one of the built-in signed or unsigned integer types (such as <a class=\"xref\" href=\"../../../api/system.byte\" data-linktype=\"relative-path\">Byte</a>, <a class=\"xref\" href=\"../../../api/system.int32\" data-linktype=\"relative-path\">Int32</a>, or <a class=\"xref\" href=\"../../../api/system.uint64\" data-linktype=\"relative-path\">UInt64</a>), and a set of fields. The fields are static literal fields, each of which represents a constant. The same value can be assigned to multiple fields. When this occurs, you must mark one of the values as the primary enumeration value for reflection and string conversion.</p>\n<p>You can assign a value of the underlying type to an enumeration and vice versa (no cast is required by the runtime). You can create an instance of an enumeration and call the methods of <a class=\"xref\" href=\"../../../api/system.enum\" data-linktype=\"relative-path\">System.Enum</a>, as well as any methods defined on the enumeration&#39;s underlying type. However, some languages might not let you pass an enumeration as a parameter when an instance of the underlying type is required (or vice versa).</p>\n<p>The following additional restrictions apply to enumerations: </p>\n<ul>\n<li><p>They cannot define their own methods.</p>\n</li>\n<li><p>They cannot implement interfaces.</p>\n</li>\n<li><p>They cannot define properties or events.</p>\n</li>\n<li><p>They cannot be generic, unless they are generic only because they are nested within a generic type. That is, an enumeration cannot have type parameters of its own. </p>\n</li>\n</ul>\n<div class=\"NOTE\"><h5>Note</h5><p>Nested types (including enumerations) created with C# include the type parameters of all enclosing generic types, and are therefore generic even if they do not have type parameters of their own. For more information, see the <a class=\"xref\" href=\"../../../api/system.type#System_Type_MakeGenericType_System_Type___\" data-linktype=\"relative-path\">Type.MakeGenericType</a> reference topic. </p>\n</div>\n<p>The <a class=\"xref\" href=\"../../../api/system.flagsattribute\" data-linktype=\"relative-path\">FlagsAttribute</a> attribute denotes a special kind of enumeration called a bit field. The runtime itself does not distinguish between traditional enumerations and bit fields, but your language might do so. When this distinction is made, bitwise operators can be used on bit fields, but not on enumerations, to generate unnamed values. Enumerations are generally used for lists of unique elements, such as days of the week, country or region names, and so on. Bit fields are generally used for lists of qualities or quantities that might occur in combination, such as <code>Red And Big And Fast</code>.</p>\n<p>The following example shows how to use both bit fields and traditional enumerations.</p>\n<pre class=\"loading\"><code class=\"lang-csharp\">using System;\nusing System.Collections.Generic;\n\n// A traditional enumeration of some root vegetables.\npublic enum SomeRootVegetables\n{\n    HorseRadish,\n    Radish,\n    Turnip\n}\n\n// A bit field or flag enumeration of harvesting seasons.\n[Flags]\npublic enum Seasons\n{\n    None = 0,\n    Summer = 1,\n    Autumn = 2,\n    Winter = 4,\n    Spring = 8,\n    All = Summer | Autumn | Winter | Spring\n}\n\npublic class Example\n{\n   public static void Main()\n   {\n       // Hash table of when vegetables are available.\n       Dictionary&lt;SomeRootVegetables, Seasons&gt; AvailableIn = new Dictionary&lt;SomeRootVegetables, Seasons&gt;();\n\n       AvailableIn[SomeRootVegetables.HorseRadish] = Seasons.All;\n       AvailableIn[SomeRootVegetables.Radish] = Seasons.Spring;\n       AvailableIn[SomeRootVegetables.Turnip] = Seasons.Spring | \n            Seasons.Autumn;\n\n       // Array of the seasons, using the enumeration.\n       Seasons[] theSeasons = new Seasons[] { Seasons.Summer, Seasons.Autumn, \n            Seasons.Winter, Seasons.Spring };\n\n       // Print information of what vegetables are available each season.\n       foreach (Seasons season in theSeasons)\n       {\n          Console.Write(String.Format(\n              &quot;The following root vegetables are harvested in {0}:\\n&quot;, \n              season.ToString(&quot;G&quot;)));\n          foreach (KeyValuePair&lt;SomeRootVegetables, Seasons&gt; item in AvailableIn)\n          {\n             // A bitwise comparison.\n             if (((Seasons)item.Value &amp; season) &gt; 0)\n                 Console.Write(String.Format(&quot;  {0:G}\\n&quot;, \n                      (SomeRootVegetables)item.Key));\n          }\n       }\n   }\n}\n// The example displays the following output:\n//    The following root vegetables are harvested in Summer:\n//      HorseRadish\n//    The following root vegetables are harvested in Autumn:\n//      Turnip\n//      HorseRadish\n//    The following root vegetables are harvested in Winter:\n//      HorseRadish\n//    The following root vegetables are harvested in Spring:\n//      Turnip\n//      Radish\n//      HorseRadish\n</code></pre><pre class=\"loading\"><code class=\"lang-vb\">Imports System.Collections.Generic\n\n&#39; A traditional enumeration of some root vegetables.\nPublic Enum SomeRootVegetables\n   HorseRadish\n   Radish\n   Turnip\nEnd Enum \n\n&#39; A bit field or flag enumeration of harvesting seasons.\n&lt;Flags()&gt; Public Enum Seasons\n   None = 0\n   Summer = 1\n   Autumn = 2\n   Winter = 4\n   Spring = 8\n   All = Summer Or Autumn Or Winter Or Spring\nEnd Enum \n\n&#39; Entry point.\nPublic Class Example\n   Public Shared Sub Main()\n      &#39; Hash table of when vegetables are available.\n      Dim AvailableIn As New Dictionary(Of SomeRootVegetables, Seasons)()\n\n      AvailableIn(SomeRootVegetables.HorseRadish) = Seasons.All\n      AvailableIn(SomeRootVegetables.Radish) = Seasons.Spring\n      AvailableIn(SomeRootVegetables.Turnip) = Seasons.Spring Or _\n                                               Seasons.Autumn\n\n      &#39; Array of the seasons, using the enumeration.\n      Dim theSeasons() As Seasons = {Seasons.Summer, Seasons.Autumn, _\n                                     Seasons.Winter, Seasons.Spring}\n\n      &#39; Print information of what vegetables are available each season.\n      For Each season As Seasons In theSeasons\n         Console.WriteLine(String.Format( _\n              &quot;The following root vegetables are harvested in {0}:&quot;, _\n              season.ToString(&quot;G&quot;)))\n         For Each item As KeyValuePair(Of SomeRootVegetables, Seasons) In AvailableIn\n            &#39; A bitwise comparison.\n            If(CType(item.Value, Seasons) And season) &gt; 0 Then\n               Console.WriteLine(&quot;  &quot; + _\n                     CType(item.Key, SomeRootVegetables).ToString(&quot;G&quot;))\n            End If\n         Next\n      Next\n   End Sub \nEnd Class \n&#39; The example displays the following output:\n&#39;    The following root vegetables are harvested in Summer:\n&#39;      HorseRadish\n&#39;    The following root vegetables are harvested in Autumn:\n&#39;      Turnip\n&#39;      HorseRadish\n&#39;    The following root vegetables are harvested in Winter:\n&#39;      HorseRadish\n&#39;    The following root vegetables are harvested in Spring:\n&#39;      Turnip\n&#39;      Radish\n&#39;      HorseRadish\n</code></pre><h3 id=\"interfaces\">Interfaces</h3>\n<p>An interface defines a contract that specifies a &quot;can do&quot; relationship or a &quot;has a&quot; relationship. Interfaces are often used to implement functionality, such as comparing and sorting (the <a class=\"xref\" href=\"../../../api/system.icomparable\" data-linktype=\"relative-path\">IComparable</a> and <a class=\"xref\" href=\"../../../api/system.icomparable-1\" data-linktype=\"relative-path\">IComparable&lt;T&gt;</a> interfaces), testing for equality (the <a class=\"xref\" href=\"../../../api/system.iequatable-1\" data-linktype=\"relative-path\">IEquatable&lt;T&gt;</a> interface), or enumerating items in a collection (the <a class=\"xref\" href=\"../../../api/system.collections.ienumerable\" data-linktype=\"relative-path\">IEnumerable</a> and <a class=\"xref\" href=\"../../../api/system.collections.generic.ienumerable-1\" data-linktype=\"relative-path\">IEnumerable&lt;T&gt;</a> interfaces). Interfaces can have properties, methods, and events, all of which are abstract members; that is, although the interface defines the members and their signatures, it leaves it to the type that implements the interface to define the functionality of each interface member. This means that any class or structure that implements an interface must supply definitions for the abstract members declared in the interface. An interface can require any implementing class or structure to also implement one or more other interfaces.</p>\n<p>The following restrictions apply to interfaces: </p>\n<ul>\n<li><p>An interface can be declared with any accessibility, but interface members must all have public accessibility.</p>\n</li>\n<li><p>Interfaces cannot define constructors.</p>\n</li>\n<li><p>Interfaces cannot define fields.</p>\n</li>\n<li><p>Interfaces can define only instance members. They cannot define static members.</p>\n</li>\n</ul>\n<p>Each language must provide rules for mapping an implementation to the interface that requires the member, because more than one interface can declare a member with the same signature, and these members can have separate implementations.</p>\n<h3 id=\"delegates\">Delegates</h3>\n<p>Delegates are reference types that serve a purpose similar to that of function pointers in C++. They are used for event handlers and callback functions in .NET. Unlike function pointers, delegates are secure, verifiable, and type safe. A delegate type can represent any instance method or static method that has a compatible signature. </p>\n<p>A parameter of a delegate is compatible with the corresponding parameter of a method if the type of the delegate parameter is more restrictive than the type of the method parameter, because this guarantees that an argument passed to the delegate can be passed safely to the method.</p>\n<p>Similarly, the return type of a delegate is compatible with the return type of a method if the return type of the method is more restrictive than the return type of the delegate, because this guarantees that the return value of the method can be cast safely to the return type of the delegate.</p>\n<p>For example, a delegate that has a parameter of type <a class=\"xref\" href=\"../../../api/system.collections.ienumerable\" data-linktype=\"relative-path\">IEnumerable</a> and a return type of <a class=\"xref\" href=\"../../../api/system.object\" data-linktype=\"relative-path\">Object</a> can represent a method that has a parameter of type <a class=\"xref\" href=\"../../../api/system.object\" data-linktype=\"relative-path\">Object</a> and a return value of type <a class=\"xref\" href=\"../../../api/system.collections.ienumerable\" data-linktype=\"relative-path\">IEnumerable</a>. </p>\n<p> A delegate is said to be bound to the method it represents. In addition to being bound to the method, a delegate can be bound to an object. The object represents the first parameter of the method, and is passed to the method every time the delegate is invoked. If the method is an instance method, the bound object is passed as the implicit <code>this</code> parameter (<code>Me</code> in Visual Basic); if the method is static, the object is passed as the first formal parameter of the method, and the delegate signature must match the remaining parameters. </p>\n<p> All delegates inherit from <a class=\"xref\" href=\"../../../api/system.multicastdelegate\" data-linktype=\"relative-path\">System.MulticastDelegate</a>, which inherits from <a class=\"xref\" href=\"../../../api/system.delegate\" data-linktype=\"relative-path\">System.Delegate</a>. The C# and Visual Basic languages don&#39;t allow inheritance from these types. Instead, they provide keywords for declaring delegates.</p>\n<p> Because delegates inherit from <a class=\"xref\" href=\"../../../api/system.multicastdelegate\" data-linktype=\"relative-path\">MulticastDelegate</a>, a delegate has an invocation list, which is a list of methods that the delegate represents and that are executed when the delegate is invoked. All methods in the list receive the arguments supplied when the delegate is invoked.</p>\n<div class=\"NOTE\"><h5>Note</h5><p>The return value is not defined for a delegate that has more than one method in its invocation list, even if the delegate has a return type.</p>\n</div>\n<p>In many cases, such as with callback methods, a delegate represents only one method, and the only actions you have to take are creating the delegate and invoking it. </p>\n<p>For delegates that represent multiple methods, .NET provides methods of the <a class=\"xref\" href=\"../../../api/system.delegate\" data-linktype=\"relative-path\">Delegate</a> and <a class=\"xref\" href=\"../../../api/system.multicastdelegate\" data-linktype=\"relative-path\">MulticastDelegate</a> delegate classes to support operations such as adding a method to a delegate&#39;s invocation list (the <a class=\"xref\" href=\"../../../api/system.delegate#System_Delegate_Combine_System_Delegate_System_Delegate_\" data-linktype=\"relative-path\">Delegate.Combine</a> method), removing a method (the <a class=\"xref\" href=\"../../../api/system.delegate#System_Delegate_Remove_System_Delegate_System_Delegate_\" data-linktype=\"relative-path\">Delegate.Remove</a> method), and getting the invocation list (the <a class=\"xref\" href=\"../../../api/system.delegate#System_Delegate_GetInvocationList\" data-linktype=\"relative-path\">Delegate.GetInvocationList</a> method).</p>\n<div class=\"NOTE\"><h5>Note</h5><p>It is not necessary to use these methods for event-handler delegates in C# or Visual Basic, because these languages provide syntax for adding and removing event handlers.</p>\n</div>\n<h2 id=\"type-definitions\">Type definitions</h2>\n<p>A type definition includes the following: </p>\n<ul>\n<li><p>Any attributes defined on the type.</p>\n</li>\n<li><p>The type&#39;s accessibility (visibility).</p>\n</li>\n<li><p>The type&#39;s name.</p>\n</li>\n<li><p>The type&#39;s base type.</p>\n</li>\n<li><p>Any interfaces implemented by the type.</p>\n</li>\n<li><p>Definitions for each of the type&#39;s members.</p>\n</li>\n</ul>\n<h3 id=\"attributes\">Attributes</h3>\n<p>Attributes provide additional user-defined metadata. Most commonly, they are used to store additional information about a type in its assembly, or to modify the behavior of a type member in either the design-time or run-time environment. </p>\n<p>Attributes are themselves classes that inherit from <a class=\"xref\" href=\"../../../api/system.attribute\" data-linktype=\"relative-path\">System.Attribute</a>. Languages that support the use of attributes each have their own syntax for applying attributes to a language element. Attributes can be applied to almost any language element; the specific elements to which an attribute can be applied are defined by the <a class=\"xref\" href=\"../../../api/system.attributeusageattribute\" data-linktype=\"relative-path\">AttributeUsageAttribute</a> that is applied to that attribute class.</p>\n<h3 id=\"type-accessibility\">Type accessibility</h3>\n<p>All types have a modifier that governs their accessibility from other types. The following table describes the type accessibilities supported by the runtime.</p>\n<table>\n<thead>\n<tr>\n<th>Accessibility</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>public</td>\n<td>The type is accessible by all assemblies.</td>\n</tr>\n<tr>\n<td>assembly</td>\n<td>The type is accessible only from within its assembly.</td>\n</tr>\n</tbody>\n</table>\n<p>The accessibility of a nested type depends on its accessibility domain, which is determined by both the declared accessibility of the member and the accessibility domain of the immediately containing type. However, the accessibility domain of a nested type cannot exceed that of the containing type.</p>\n<p>The accessibility domain of a nested member <code>M</code> declared in a type <code>T</code>within a program <code>P</code> is defined as follows (noting that <code>M</code> might itself be a type): </p>\n<ul>\n<li><p>If the declared accessibility of <code>M</code> is <code>public</code>, the accessibility domain of <code>M</code> is the accessibility domain of <code>T</code>.</p>\n</li>\n<li><p>If the declared accessibility of <code>M</code> is <code>protected internal</code>, the accessibility domain of <code>M</code> is the intersection of the accessibility domain of <code>T</code> with the program text of <code>P</code> and the program text of any type derived from <code>T</code> declared outside <code>P</code>.</p>\n</li>\n<li><p>If the declared accessibility of <code>M</code> is <code>protected</code>, the accessibility domain of <code>M</code> is the intersection of the accessibility domain of <code>T</code> with the program text of <code>T</code> and any type derived from <code>T</code>.</p>\n</li>\n<li><p>If the declared accessibility of <code>M</code> is <code>internal</code>, the accessibility domain of <code>M</code> is the intersection of the accessibility domain of <code>T</code> with the program text of<code>P</code>.</p>\n</li>\n<li><p>If the declared accessibility of <code>M</code> is <code>private</code>, the accessibility domain of <code>M</code> is the program text of <code>T</code>.</p>\n</li>\n</ul>\n<h3 id=\"type-names\">Type names</h3>\n<p>The common type system imposes only two restrictions on names: </p>\n<ul>\n<li><p>All names are encoded as strings of Unicode (16-bit) characters.</p>\n</li>\n<li><p>Names are not permitted to have an embedded (16-bit) value of 0x0000.</p>\n</li>\n</ul>\n<p>However, most languages impose additional restrictions on type names. All comparisons are done on a byte-by-byte basis, and are therefore case-sensitive and locale-independent.</p>\n<p>Although a type might reference types from other modules and assemblies, a type must be fully defined within one .NET module. (Depending on compiler support, however, it can be divided into multiple source code files.) Type names need be unique only within a namespace. To fully identify a type, the type name must be qualified by the namespace that contains the implementation of the type.</p>\n<h3 id=\"base-types-and-interfaces\">Base types and interfaces</h3>\n<p>A type can inherit values and behaviors from another type. The common type system does not allow types to inherit from more than one base type.</p>\n<p>A type can implement any number of interfaces. To implement an interface, a type must implement all the virtual members of that interface. A virtual method can be implemented by a derived type and can be invoked either statically or dynamically.</p>\n<h2 id=\"type-members\">Type members</h2>\n<p>The runtime enables you to define members of your type, which specifies the behavior and state of a type. Type members include the following:</p>\n<ul>\n<li><p><a href=\"#fields\" data-linktype=\"self-bookmark\">Fields</a></p>\n</li>\n<li><p><a href=\"#properties\" data-linktype=\"self-bookmark\">Properties</a></p>\n</li>\n<li><p><a href=\"#methods\" data-linktype=\"self-bookmark\">Methods</a></p>\n</li>\n<li><p><a href=\"#constructors\" data-linktype=\"self-bookmark\">Constructors</a></p>\n</li>\n<li><p><a href=\"#events\" data-linktype=\"self-bookmark\">Events</a></p>\n</li>\n<li><p><a href=\"#nested-types\" data-linktype=\"self-bookmark\">Nested types</a></p>\n</li>\n</ul>\n<h3 id=\"fields\">Fields</h3>\n<p>A field describes and contains part of the type&#39;s state. Fields can be of any type supported by the runtime. Most commonly, fields are either <code>private</code> or <code>protected</code>, so that they are accessible only from within the class or from a derived class. If the value of a field can be modified from outside its type, a property set accessor is typically used. Publicly exposed fields are usually read-only and can be of two types: </p>\n<ul>\n<li><p>Constants, whose value is assigned at design time. These are static members of a class, although they are not defined using the <code>static</code> (<code>Shared</code> in Visual Basic) keyword.</p>\n</li>\n<li><p>Read-only variables, whose values can be assigned in the class constructor.</p>\n</li>\n</ul>\n<p>The following example illustrates these two usages of read-only fields.</p>\n<pre class=\"loading\"><code class=\"lang-csharp\">using System;\n\npublic class Constants\n{\n   public const double Pi = 3.1416;\n   public readonly DateTime BirthDate;\n\n   public Constants(DateTime birthDate)\n   {\n      this.BirthDate = birthDate;\n   }\n}\n\npublic class Example\n{\n   public static void Main()\n   {\n      Constants con = new Constants(new DateTime(1974, 8, 18));\n      Console.Write(Constants.Pi + &quot;\\n&quot;);\n      Console.Write(con.BirthDate.ToString(&quot;d&quot;) + &quot;\\n&quot;);\n   }\n}\n// The example displays the following output if run on a system whose current\n// culture is en-US:\n//    3.1417\n//    8/18/1974\n</code></pre><pre class=\"loading\"><code class=\"lang-vb\">Public Class Constants\n   Public Const Pi As Double = 3.1416\n   Public ReadOnly BirthDate As Date\n\n   Public Sub New(birthDate As Date)\n      Me.BirthDate = birthDate\n   End Sub\nEnd Class\n\nPublic Module Example\n   Public Sub Main()\n      Dim con As New Constants(#8/18/1974#)\n      Console.WriteLine(Constants.Pi.ToString())\n      Console.WriteLine(con.BirthDate.ToString(&quot;d&quot;))\n   End Sub\nEnd Module\n&#39; The example displays the following output if run on a system whose current\n&#39; culture is en-US:\n&#39;    3.1417\n&#39;    8/18/1974\n</code></pre><h3 id=\"properties\">Properties</h3>\n<p>A property names a value or state of the type and defines methods for getting or setting the property&#39;s value. Properties can be primitive types, collections of primitive types, user-defined types, or collections of user-defined types. Properties are often used to keep the public interface of a type independent from the type&#39;s actual representation. This enables properties to reflect values that are not directly stored in the class (for example, when a property returns a computed value) or to perform validation before values are assigned to private fields. The following example illustrates the latter pattern.</p>\n<pre class=\"loading\"><code class=\"lang-csharp\">using System;\n\npublic class Person\n{\n   private int m_Age;\n\n   public int Age\n   { \n      get { return m_Age; }\n      set {\n         if (value &lt; 0 || value &gt; 125)\n         {\n            throw new ArgumentOutOfRangeException(&quot;The value of the Age property must be between 0 and 125.&quot;);\n         }\n         else\n         {\n            m_Age = value;\n         }         \n      }\n   }\n}\n</code></pre><pre class=\"loading\"><code class=\"lang-vb\">Public Class Person\n   Private m_Age As Integer\n\n   Public Property Age As Integer\n      Get\n         Return m_Age\n      End Get\n      Set\n         If value &lt; 0 Or value &gt; 125 Then\n            Throw New ArgumentOutOfRangeException(&quot;The value of the Age property must be between 0 and 125.&quot;)\n         Else\n            m_Age = value\n         End If\n      End Set\n   End Property\nEnd Class\n</code></pre><p>In addition to including the property itself, the Microsoft intermediate language (MSIL) for a type that contains a readable property includes a <code>get</code><em>_propertyname</em> method, and the MSIL for a type that contains a writable property includes a <code>set</code><em>_propertyname</em> method.</p>\n<h3 id=\"methods\">Methods</h3>\n<p>A method describes operations that are available on the type. A method&#39;s signature specifies the allowable types of all its parameters and of its return value.</p>\n<p>Although most methods define the precise number of parameters required for method calls, some methods support a variable number of parameters. The final declared parameter of these methods is marked with the <a class=\"xref\" href=\"../../../api/system.paramarrayattribute\" data-linktype=\"relative-path\">ParamArrayAttribute</a> attribute. Language compilers typically provide a keyword, such as <code>params</code> in C# and <code>ParamArray</code> in Visual Basic, that makes explicit use of <a class=\"xref\" href=\"../../../api/system.paramarrayattribute\" data-linktype=\"relative-path\">ParamArrayAttribute</a> unnecessary.</p>\n<h3 id=\"constructors\">Constructors</h3>\n<p>A constructor is a special kind of method that creates new instances of a class or structure. Like any other method, a constructor can include parameters; however, constructors have no return value (that is, they return <code>void</code>). </p>\n<p>If the source code for a class does not explicitly define a constructor, the compiler includes a default (parameterless) constructor. However, if the source code for a class defines only parameterized constructors, the C# compiler doesn&#39;t generate a parameterless constructor.</p>\n<p>If the source code for a structure defines constructors, they must be parameterized; a structure cannot define a default (parameterless) constructor, and compilers do not generate parameterless constructors for structures or other value types. All value types do have an implicit default constructor. This constructor is implemented by the common language runtime and initializes all fields of the structure to their default values. </p>\n<h3 id=\"events\">Events</h3>\n<p>An event defines an incident that can be responded to, and defines methods for subscribing to, unsubscribing from, and raising the event. Events are often used to inform other types of state changes.</p>\n<h3 id=\"nested-types\">Nested types</h3>\n<p>A nested type is a type that is a member of some other type. Nested types should be tightly coupled to their containing type and must not be useful as a general-purpose type. Nested types are useful when the declaring type uses and creates instances of the nested type, and use of the nested type is not exposed in public members.</p>\n<p>Nested types are confusing to some developers and should not be publicly visible unless there is a compelling reason for visibility. In a well-designed library, developers should rarely have to use nested types to instantiate objects or declare variables.</p>\n<h2 id=\"characteristics-of-type-members\">Characteristics of type members</h2>\n<p>The common type system allows type members to have a variety of characteristics; however, languages are not required to support all these characteristics. The following table describes member characteristics.</p>\n<table>\n<thead>\n<tr>\n<th>Characteristic</th>\n<th>Can apply to</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>abstract</td>\n<td>Methods, properties, and events</td>\n<td>The type does not supply the method&#39;s implementation. Types that inherit or implement abstract methods must supply an implementation for the method. The only exception is when the derived type is itself an abstract type. All abstract methods are virtual.</td>\n</tr>\n<tr>\n<td>private</td>\n<td>All</td>\n<td>Accessible only from within the same type as the member, or within a nested type.</td>\n</tr>\n<tr>\n<td>family</td>\n<td>All</td>\n<td>Accessible from within the same type as the member, and from derived types that inherit from it.</td>\n</tr>\n<tr>\n<td>assemby</td>\n<td>All</td>\n<td>Accessible only in the assembly in which the type is defined.</td>\n</tr>\n<tr>\n<td>family and assembly</td>\n<td>All</td>\n<td>Accessible only from types that qualify for both family and assembly access.</td>\n</tr>\n<tr>\n<td>family or assemby</td>\n<td>All</td>\n<td>Accessible only from types that qualify for either family or assembly access.</td>\n</tr>\n<tr>\n<td>public</td>\n<td>All</td>\n<td>Accessible from any type.</td>\n</tr>\n<tr>\n<td>final</td>\n<td>Methods, properties, and events</td>\n<td>The virtual method cannot be overridden in a derived type.</td>\n</tr>\n<tr>\n<td>initialize-only</td>\n<td>Fields</td>\n<td>The value can only be initialized, and cannot be written after initialization.</td>\n</tr>\n<tr>\n<td>instance</td>\n<td>Fields, methods, properties, and events</td>\n<td>If a member is not marked as <code>static</code> (C#), <code>Shared</code> (Visual Basic), <code>virtual</code> (C#), or <code>Overridable</code> (Visual Basic),  it is an instance member (there is no instance keyword). There will be as many copies of such members in memory as there are objects that use it.</td>\n</tr>\n<tr>\n<td>literal</td>\n<td>Fields</td>\n<td>The value assigned to the field is a fixed value, known at compile time, of a built-in value type. Literal fields are sometimes referred to as constants.</td>\n</tr>\n<tr>\n<td>newslot or override</td>\n<td>All</td>\n<td>Defines how the member interacts with inherited members that have the same signature: <code>newslot</code> hides inherited members that have the same signature; <code>override</code> replaces the definition of an inherited virtual method. The default is newslot.</td>\n</tr>\n<tr>\n<td>static</td>\n<td>Fields, methods, properties, and events</td>\n<td>The member belongs to the type it is defined on, not to a particular instance of the type; the member exists even if an instance of the type is not created, and it is shared among all instances of the type.</td>\n</tr>\n<tr>\n<td>virtual</td>\n<td>Methods, properties, and events</td>\n<td>The method can be implemented by a derived type and can be invoked either statically or dynamically. If dynamic invocation is used, the type of the instance that makes the call at run time (rather than the type known at compile time) determines which implementation of the method is called. To invoke a virtual method statically, the variable might have to be cast to a type that uses the desired version of the method.</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"overloading\">Overloading</h3>\n<p>Each type member has a unique signature. Method signatures consist of the method name and a parameter list (the order and types of the method&#39;s arguments). Multiple methods with the same name can be defined within a type as long as their signatures differ. When two or more methods with the same name are defined, the method is said to be overloaded. For example, in <a class=\"xref\" href=\"../../../api/system.char\" data-linktype=\"relative-path\">System.Char</a>, the <code>IsDigit</code> method is overloaded. One method takes a <a class=\"xref\" href=\"../../../api/system.char\" data-linktype=\"relative-path\">Char</a>. The other method takes a <a class=\"xref\" href=\"../../../api/system.string\" data-linktype=\"relative-path\">String</a> and an <a class=\"xref\" href=\"../../../api/system.int32\" data-linktype=\"relative-path\">Int32</a>. </p>\n<div class=\"NOTE\"><h5>Note</h5><p>The return type is not considered part of a method&#39;s signature. That is, methods cannot be overloaded if they differ only by return type.</p>\n</div>\n<h3 id=\"inheriting-overriding-and-hiding-members\">Inheriting, overriding, and hiding members</h3>\n<p>A derived type inherits all members of its base type; that is, these members are defined on, and available to, the derived type. The behavior or qualities of inherited members can be modified in two ways: </p>\n<ul>\n<li><p>A derived type can hide an inherited member by defining a new member with the same signature. This might be done to make a previously public member private or to define new behavior for an inherited method that is marked as <code>final</code>.</p>\n</li>\n<li><p>A derived type can override an inherited virtual method. The overriding method provides a new definition of the method that will be invoked based on the type of the value at run time rather than the type of the variable known at compile time. A method can override a virtual method only if the virtual method is not marked as <code>final</code> and the new method is at least as accessible as the virtual method.</p>\n</li>\n</ul>\n<h2 id=\"see-also\">See also</h2>\n<p><a href=\"type-conversion\" data-linktype=\"relative-path\">Type conversion in the .NET Framework</a></p>\n</div></div>","outputRootRelativePath":"../../../","pageMetadata":"<meta name=\"author\" content=\"stevehoag\">\r\n<meta name=\"ms.author\" content=\"shoag\">\r\n<meta name=\"manager\" content=\"wpickett\">\r\n<meta name=\"breadcrumb_path\" content=\"/dotnet-internal/toc2.json\">\r\n<meta name=\"ms.devlang\" content=\"dotnet\">\r\n<meta name=\"ms.assetid\" content=\"b5482a1d-7bdc-40fe-aa45-10df930ceb5b\">\r\n<meta name=\"description\" content=\"Common type system in depth\">\r\n<meta name=\"keywords\" content=\".NET, .NET Core\">\r\n<meta name=\"ms.topic\" content=\"article\">\r\n<meta name=\"ms.date\" content=\"07/20/2016\">\r\n<meta name=\"ms.technology\" content=\"dotnet-standard\">\r\n<meta name=\"ms.prod\" content=\".net\">\r\n<meta name=\"search.ms_sitename\" content=\"Docs\">\r\n<meta name=\"search.ms_docsetname\" content=\"docs-internal\">\r\n<meta name=\"version\" content=\"0\">\r\n<meta name=\"locale\" content=\"en-us\">\r\n<meta name=\"site_name\" content=\"Docs\">\r\n<meta name=\"search.ms_product\" content=\"MSDN\">\r\n<meta name=\"depot_name\" content=\"MSDN.docs-internal\">\r\n<meta name=\"updated_at\" content=\"2017-03-21 01:42 AM\">\r\n<meta name=\"gitcommit\" content=\"https://github.com/dotnet/docs-internal/blob/90fe68f7f3c4b46502b5d3770b1a2d57c6af748a/docs/standard/base-types/common-type-system.md\">\r\n<meta name=\"original_content_git_url\" content=\"https://github.com/dotnet/docs-internal/blob/tianzhXamarin/docs/standard/base-types/common-type-system.md\">\r\n<meta name=\"document_id\" content=\"58b71d27-ac5a-7cc0-c959-df5605554b9f\">\r\n<meta name=\"pagetype\" content=\"Conceptual\">\r\n<meta name=\"toc_rel\" content=\"../../toc2.json\">\r\n","rawMetadata":{"author":"stevehoag","ms.author":"shoag","manager":"wpickett","breadcrumb_path":"/dotnet-internal/toc.json","title":"Common type system in depth | Microsoft Docs","ms.devlang":"dotnet","ms.assetid":"b5482a1d-7bdc-40fe-aa45-10df930ceb5b","description":"Common type system in depth","keywords":".NET, .NET Core","ms.topic":"article","ms.date":"07/20/2016","ms.technology":"dotnet-standard","ms.prod":".net","search.ms_sitename":"Docs","search.ms_docsetname":"docs-internal","version":0,"_op_canonicalUrlPrefix":"https://docs.microsoft.com/en-us/dotnet-internal/","locale":"en-us","site_name":"Docs","search.ms_product":"MSDN","_op_openToPublicContributors":false,"depot_name":"MSDN.docs-internal","_op_gitCommitHistory":[{"author_name":"Maira Wenzel","author_email":"mairaw@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"Metadata updates (#1313)","commit_sha":"90fe68f7f3c4b46502b5d3770b1a2d57c6af748a","commit_date":"2016-12-09 12:40:41 -0800"},{"author_name":"Maira Wenzel","author_email":"mairaw@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"fixed broken anchors (#1194)","commit_sha":"b20713600d7c3ddc31be5885733a1e8910ede8c6","commit_date":"2016-11-02 20:45:13 -0700"},{"author_name":"Steve Hoag","author_email":"shoag@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"Porting base type docs take 4 (#1053)","commit_sha":"fb00da6505c9edb6a49d2003ae9bcb8e74c11d6c","commit_date":"2016-10-06 10:32:59 -0700"}],"updated_at":"2017-03-21 01:42 AM","_op_gitContributorInformation":{"author":{"profile_url":"https://github.com/stevehoag","display_name":"Steve Hoag","id":"13489215"},"contributors":[{"profile_url":"https://github.com/stevehoag","display_name":"Steve Hoag"},{"profile_url":"https://github.com/mairaw","display_name":"Maira Wenzel","id":"12971179"}],"update_at":"3/21/2017"},"gitcommit":"https://github.com/dotnet/docs-internal/blob/90fe68f7f3c4b46502b5d3770b1a2d57c6af748a/docs/standard/base-types/common-type-system.md","original_content_git_url":"https://github.com/dotnet/docs-internal/blob/tianzhXamarin/docs/standard/base-types/common-type-system.md","open_to_public_contributors":false,"content_git_url":"https://github.com/dotnet/docs/blob/master/docs/standard/base-types/common-type-system.md","document_id":"58b71d27-ac5a-7cc0-c959-df5605554b9f","layout":"Conceptual","pagetype":"Conceptual","canonical_url":"https://docs.microsoft.com/en-us/dotnet-all/articles/standard/base-types/common-type-system","toc_asset_id":"articles/toc.json","toc_rel":"../../toc.json","_op_ogTitle":"Common type system in depth","_op_displayDate":"2016-7-20","_op_displayDate_source":"2016-07-20T00:00:00Z","_op_wordCount":4648,"_op_rawTitle":"<h1 id=\"common-type-system-in-depth\" sourcefile=\"docs/standard/base-types/common-type-system.md\" sourcestartlinenumber=\"15\" sourceendlinenumber=\"15\">Common type system in depth</h1>","_op_searchScope":[".NET"],"_op_canonicalUrl":"https://docs.microsoft.com/en-us/dotnet-all/articles/standard/base-types/common-type-system","fileRelativePath":"articles/standard/base-types/common-type-system.html"},"themesRelativePathToOutputRoot":"_themes/"}