{"content":"<div><div class=\"content\">\n<p>You can create two types of deployments for .NET Core applications: </p>\n<ul>\n<li><p>Framework-dependent deployment. As the name implies, framework-dependent deployment (FDD) relies on a shared system-wide version of .NET Core to be present on the target system. Because .NET Core is already present, your app is also portable between installations of .NET Core. Your app contains only its own code and any third-party dependencies that are outside of the .NET Core libraries. FDDs contain .dll files that can be launched by using the <a href=\"../tools/dotnet\" data-linktype=\"relative-path\">dotnet utility</a> from the command line. For example, <code>dotnet app.dll</code> runs an application named <code>app</code>.</p>\n</li>\n<li><p>Self-contained deployment. Unlike FDD, a self-contained deployment (SCD) does not rely on any shared components to be present on the target system. All components, including both .NET Core libraries and the .NET Core runtime, are included with the application and are isolated from other .NET Core applications. SCDs include an executable (such as <code>app.exe</code> on Windows platforms for an application named <code>app</code>), which is  a renamed version of the platform-specific .NET Core host, and a .dll file (such as <code>app.dll</code>), which is the actual application.</p>\n</li>\n</ul>\n<h2 id=\"framework-dependent-deployments-fdd\">Framework-dependent deployments (FDD)</h2>\n<p>For an FDD, you deploy only your app and any third-party dependencies. You do not have to deploy .NET Core, since your app will use the version of .NET Core that&#39;s present on the target system. This is the default deployment model for .NET Core apps.</p>\n<h3 id=\"why-create-a-framework-dependent-deployment\">Why create a framework-dependent deployment?</h3>\n<p>Deploying an FDD has a number of advantages:</p>\n<ul>\n<li><p>You do not have to define the target operating systems that your .NET Core app will run on in advance. Because .NET Core uses a common PE file format for executables and libraries regardless of operating system, .NET Core can execute your app regardless of the underlying operating system. For more information on the PE file format, see <a href=\"../../standard/assembly-format\" data-linktype=\"relative-path\">.NET Assembly File Format</a>.</p>\n</li>\n<li><p>The size of your deployment package is small. You only have to deploy your app and its dependencies, not .NET Core itself.</p>\n</li>\n<li><p>Multiple apps use the same .NET Core installation, which reduces both disk space and memory usage on host systems.</p>\n</li>\n</ul>\n<p>There are also a few disadvantages:</p>\n<ul>\n<li><p>Your app can run only if the version of .NET Core that you target, or a later version, is already installed on the host system.</p>\n</li>\n<li><p>It is possible for the .NET Core runtime and libraries to change without your knowledge in future releases. In rare cases, this may change the behavior of your app.</p>\n</li>\n</ul>\n<h3 id=\"deploying-a-framework-dependent-deployment\">Deploying a framework-dependent deployment</h3>\n<p>Deploying a framework-dependent deployment with no third-party dependencies simply involves building, testing, and publishing the app. A simple example written in C# illustrates the process. The example uses the <a href=\"../tools/dotnet\" data-linktype=\"relative-path\">dotnet utility</a> from the command line; however, you can also use a development environment, such as Visual Studio or Visual Studio Code, to compile, test, and publish the example.</p>\n<ol>\n<li><p>Create a directory for your project; and from the command line, type <a href=\"../tools/dotnet-new\" data-linktype=\"relative-path\"><code>dotnet new console</code></a> to create a new C# console project.</p>\n</li>\n<li><p>Open the <code>Program.cs</code> file in an editor, and replace the auto-generated code with the following code. It prompts the user to enter text, and then displays the individual words entered by the user. It uses the regular expression <code>\\w+</code> to separate the words in the input text.</p>\n<pre class=\"loading\"><code class=\"lang-cs\"> using System;\n using System.Text.RegularExpressions;\n\n namespace Applications.ConsoleApps\n {\n     public class ConsoleParser\n     {\n         public static void Main()\n         {\n              Console.WriteLine(&quot;Enter any text, followed by &lt;Enter&gt;:\\n&quot;);\n              String s = Console.ReadLine();\n              ShowWords(s);\n              Console.Write(&quot;\\nPress any key to continue... &quot;);\n              Console.ReadKey();\n       }\n\n       private static void ShowWords(String s)\n       {\n           String pattern = @&quot;\\w+&quot;;\n           var matches = Regex.Matches(s, pattern);\n           if (matches.Count == 0)\n               Console.WriteLine(&quot;\\nNo words were identified in your input.&quot;);\n           else\n           {\n               Console.WriteLine(&quot;\\nThere are {0} words in your string:&quot;, matches.Count);\n               for (int ctr = 0; ctr &lt; matches.Count; ctr++)\n                   Console.WriteLine(&quot;   #{0,2}: &#39;{1}&#39; at position {2}&quot;, ctr,\n                                     matches[ctr].Value, matches[ctr].Index);\n           }\n       }\n   }\n }\n</code></pre></li>\n<li><p>Run the <a href=\"../tools/dotnet-restore\" data-linktype=\"relative-path\">dotnet restore</a> command to restore the dependencies specified in your project.</p>\n</li>\n<li><p>Create a Debug build of your app by using the <a href=\"../tools/dotnet-build\" data-linktype=\"relative-path\">dotnet build</a> command.</p>\n</li>\n<li><p>After you&#39;ve debugged and tested the program, you can create the files to be deployed with your app by using the <code>dotnet publish -f netcoreapp1.1 -c Release</code> command. This creates a Release (rather than a Debug) version of your app.</p>\n<p>The resulting files are placed in a directory named <code>publish</code> that is in a subdirectory of your project&#39;s <code>.\\bin\\Release\\netcoreapp1.1</code> subdirectory.</p>\n</li>\n<li><p>Along with your application&#39;s files, the publishing process emits a program database (.pdb) file that contains debugging information about your app. The file is useful primarily for debugging exceptions; you can choose not to package it with your application&#39;s files.</p>\n</li>\n</ol>\n<p>The complete set of application  files can be deployed in any way you&#39;d like. For example, you can package them in a zip file, use a simple <code>copy</code> command, or deploy them with any installation package of your choice.</p>\n<p>In addition to the application binaries, the installer should also either bundle the shared framework installer or check for it as a prerequisite as part of the application installation.  Installation of the shared framework requires Administrator/root access since it is machine-wide.</p>\n<h3 id=\"deploying-a-framework-dependent-deployment-with-third-party-dependencies\">Deploying a framework-dependent deployment with third-party dependencies</h3>\n<p>Deploying a framework-dependent deployment with one or more third-party dependencies involves two additional steps before you can run the <code>dotnet restore</code> command:</p>\n<ol>\n<li><p>Add references to any third-party libraries to the <code>&lt;ItemGroup&gt;</code> section of your <code>csproj</code> file. The following  <code>&lt;ItemGroup&gt;</code> section shows the <code>&lt;ItemGroup&gt;</code> containing the dependencies in the default project with Json.NET as a third-party library.</p>\n<pre class=\"loading\"><code class=\"lang-xml\">   &lt;ItemGroup&gt;\n     &lt;PackageReference Include=&quot;Newtonsoft.Json&quot; Version=&quot;9.0.1&quot; /&gt;\n   &lt;/ItemGroup&gt;\n</code></pre><p>Note that the SDK dependency remains in the above example. This is by design, since this dependency is required to restore all the needed targets to allow the command line tools to function.  </p>\n</li>\n<li><p>If you haven&#39;t already, download the NuGet package containing the third-party dependency. To download the package, execute the <code>dotnet restore</code> command after adding the dependency. Because the dependency is resolved out of the local NuGet cache at publish time, it must be available on your system.</p>\n</li>\n</ol>\n<p>Note that a framework-dependent deployment with third-party dependencies will only be as portable as its third-party dependencies. For example, if a third-party library only supports macOS, the app will not be portable to Windows systems. This can happen if the third-party dependency itself depends on native code. A good example of this is Kestrel server. When an FDD is created for an application with this kind of third-party dependency, the published output will contain a folder for each <a href=\"../rid-catalog#what-are-rids\" data-linktype=\"relative-path\">Runtime Identifier (RID)</a> that the native dependency supports (and that exists in its NuGet package).</p>\n<h2 id=\"self-contained-deployments-scd\">Self-contained deployments (SCD)</h2>\n<p>For a self-contained deployment, you deploy not only your app and any third-party dependencies, but the version of .NET Core that you build your app with. Creating an SCD does not, however, include the <a href=\"https://github.com/dotnet/core/blob/master/Documentation/prereqs.md\" data-linktype=\"external\">native dependencies of .NET Core</a> itself on various platforms (for example, OpenSSL on macOS) so these need to be installed before running the application. </p>\n<h3 id=\"why-deploy-a-self-contained-deployment\">Why deploy a Self-contained deployment?</h3>\n<p>Deploying a Self-contained deployment has two major advantages:</p>\n<ul>\n<li><p>You have sole control of the version of .NET Core that is deployed with your app. .NET Core can be serviced only by you.</p>\n</li>\n<li><p>You can be assured that the target system can run your .NET Core app, since you&#39;re providing the version of .NET Core that it will run on.</p>\n</li>\n</ul>\n<p>It also has a number of disadvantages:</p>\n<ul>\n<li><p>Because .NET Core is included in your deployment package, you must select the target platforms for which you build deployment packages in advance.</p>\n</li>\n<li><p>The size of your deployment package is relatively large, since you have to include .NET Core as well as your app and its third-party dependencies.</p>\n</li>\n<li><p>Deploying numerous self-contained .NET Core apps to a system can consume significant amounts of disk space, since each app duplicates .NET Core files.</p>\n</li>\n</ul>\n<h3 id=\"a-namesimpleselfa-deploying-a-simple-self-contained-deployment\"><a name=\"simpleSelf\"></a> Deploying a simple self-contained deployment</h3>\n<p>Deploying a self-contained deployment with no third-party dependencies involves creating the project, modifying the csproj file, building, testing, and publishing the app.  A simple example written in C# illustrates the process. The example uses the <code>dotnet</code> utility from the command line; however, you can also use a development environment, such as Visual Studio or Visual Studio Code, to compile, test, and publish the example.</p>\n<ol>\n<li><p>Create a directory for your project, and from the command line, type <code>dotnet new console</code> to create a new C# console project.</p>\n</li>\n<li><p>Open the <code>Program.cs</code> file in an editor, and replace the auto-generated code with the following code. It prompts the user to enter text, and then displays the individual words entered by the user. It uses the regular expression <code>\\w+</code> to separate the words in the input text.</p>\n<pre class=\"loading\"><code class=\"lang-cs\"> using System;\n using System.Text.RegularExpressions;\n\n namespace Applications.ConsoleApps\n {\n     public class ConsoleParser\n     {\n         public static void Main()\n         {\n              Console.WriteLine(&quot;Enter any text, followed by &lt;Enter&gt;:\\n&quot;);\n              String s = Console.ReadLine();\n              ShowWords(s);\n              Console.Write(&quot;\\nPress any key to continue... &quot;);\n              Console.ReadKey();\n       }\n\n       private static void ShowWords(String s)\n       {\n           String pattern = @&quot;\\w+&quot;;\n           var matches = Regex.Matches(s, pattern);\n           if (matches.Count == 0)\n               Console.WriteLine(&quot;\\nNo words were identified in your input.&quot;);\n           else {\n               Console.WriteLine(&quot;\\nThere are {0} words in your string:&quot;, matches.Count);\n               for (int ctr = 0; ctr &lt; matches.Count; ctr++)\n                   Console.WriteLine(&quot;   #{0,2}: &#39;{1}&#39; at position {2}&quot;, ctr,\n                                     matches[ctr].Value, matches[ctr].Index);\n           }\n       }\n   }\n }\n</code></pre></li>\n<li><p>Create a <code>&lt;RuntimeIdentifiers&gt;</code> tag under the <code>&lt;PropertyGroup&gt;</code> section in your <code>csproj</code> file that defines the platforms your app targets, and specify the runtime identifier of each platform that you target. See <a href=\"../rid-catalog\" data-linktype=\"relative-path\">Runtime IDentifier catalog</a> for a list of runtime identifiers. For example, the following example indicates that the app runs on 64-bit Windows 10 operating systems and the 64-bit OS X Version 10.11 operating system.</p>\n<pre class=\"loading\"><code class=\"lang-xml\">     &lt;PropertyGroup&gt;\n       &lt;RuntimeIdentifiers&gt;win10-x64;osx.10.11-x64&lt;/RuntimeIdentifiers&gt;\n     &lt;/PropertyGroup&gt;\n</code></pre><p>Note that you also need to add a semicolon to separate the RIDs. Also, please note that the <code>&lt;RuntimeIdentifier&gt;</code> element can go into any <code>&lt;PropertyGroup&gt;</code> that you have in your <code>csproj</code> file. A complete sample <code>csproj</code> file appears later in this section.</p>\n</li>\n<li><p>Run the <code>dotnet restore</code> command to restore the dependencies specified in your project.</p>\n</li>\n<li><p>After you&#39;ve debugged and tested the program, you can create the files to be deployed with your app for each platform that it targets by using the <code>dotnet publish</code> command for both target platforms as follows:</p>\n<pre class=\"loading\"><code class=\"lang-console\">dotnet publish -c Release -r win10-x64\ndotnet publish -c Release -r osx.10.11-x64\n</code></pre><p>This creates a Release (rather than a Debug) version of your app for each target platform. The resulting files are placed in a subdirectory named <code>publish</code> that is in a subdirectory of your project&#39;s <code>.\\bin\\Release\\netcoreapp1.1\\&lt;runtime_identifier&gt;</code> subdirectory. Note that each subdirectory contains the complete set of files (both your app files and all .NET Core files) needed to launch your app.</p>\n</li>\n<li><p>Along with your application&#39;s files, the publishing process emits a program database (.pdb) file that contains debugging information about your app. The file is useful primarily for debugging exceptions; you can choose not to package it with your application&#39;s files.</p>\n</li>\n</ol>\n<p>The published files can be deployed in any way you&#39;d like. For example, you can package them in a zip file, use a simple <code>copy</code> command, or deploy them with any installation package of your choice. </p>\n<p>The following is the complete <code>csproj</code> file for this project:</p>\n<pre class=\"loading\"><code class=\"lang-xml\">&lt;Project Sdk=&quot;Microsoft.NET.Sdk&quot;&gt;\n  &lt;PropertyGroup&gt;\n    &lt;OutputType&gt;Exe&lt;/OutputType&gt;\n    &lt;TargetFramework&gt;netcoreapp1.1&lt;/TargetFramework&gt;\n    &lt;RuntimeIdentifiers&gt;win10-x64;osx.10.11-x64&lt;/RuntimeIdentifiers&gt;\n  &lt;/PropertyGroup&gt;\n&lt;/Project&gt;\n</code></pre><h3 id=\"deploying-a-self-contained-deployment-with-third-party-dependencies\">Deploying a self-contained deployment with third-party dependencies</h3>\n<p>Deploying a self-contained deployment with one or more third-party dependencies involves adding the third party dependency:</p>\n<ol>\n<li><p>Add references to any third-party libraries to the <code>&lt;ItemGroup&gt;</code> section of your <code>csproj</code> file. The following  <code>&lt;ItemGroup&gt;</code> section uses Json.NET as a third-party library.</p>\n<pre class=\"loading\"><code class=\"lang-xml\">   &lt;ItemGroup&gt;\n     &lt;PackageReference Include=&quot;Newtonsoft.Json&quot; Version=&quot;9.0.1&quot; /&gt;\n   &lt;/ItemGroup&gt;\n</code></pre></li>\n<li>If you haven&#39;t already, download the NuGet package containing the third-party dependency to your system. To make the dependency available to your app, execute the <code>dotnet restore</code> command after adding the dependency. Because the dependency is resolved out of the local NuGet cache at publish time, it must be available on your system.</li>\n</ol>\n<p>The following is the complete csproj file for this project:</p>\n<pre class=\"loading\"><code class=\"lang-xml\">&lt;Project Sdk=&quot;Microsoft.NET.Sdk&quot;&gt;\n  &lt;PropertyGroup&gt;\n    &lt;OutputType&gt;Exe&lt;/OutputType&gt;\n    &lt;TargetFramework&gt;netcoreapp1.1&lt;/TargetFramework&gt;\n    &lt;RuntimeIdentifiers&gt;win10-x64;osx.10.11-x64&lt;/RuntimeIdentifiers&gt;\n  &lt;/PropertyGroup&gt;\n  &lt;ItemGroup&gt;\n    &lt;PackageReference Include=&quot;Newtonsoft.Json&quot; Version=&quot;9.0.1&quot; /&gt;\n  &lt;/ItemGroup&gt;\n&lt;/Project&gt;\n</code></pre><p>When you deploy your application, any third-party dependencies used in your app are also contained with your application files. Third-party libraries do not already have to be present on the system on which the app is running.</p>\n<p>Note that you can only deploy a self-contained deployment with a third-party library to platforms supported by that library. This is similar to having third-party dependencies with native dependencies in your framework-dependent deployment. </p>\n<h3 id=\"deploying-a-self-contained-deployment-with-a-smaller-footprint\">Deploying a self-contained deployment with a smaller footprint</h3>\n<p>If the availability of adequate storage space on target systems is likely to be an issue, you can reduce the overall footprint of your app by excluding some system components. To do this, you explicitly define the .NET Core components that your app includes in your csproj file.</p>\n<p>To create a self-contained deployment with a smaller footprint, start by following the first two steps for creating a self-contained deployment. Once you&#39;ve run the <code>dotnet new console</code> command and added the C# source code to your app, do the following:</p>\n<ol>\n<li><p>Open the <code>csproj</code> file and replace the <code>&lt;TargetFramework&gt;</code> element with the following:</p>\n<pre class=\"loading\"><code class=\"lang-xml\">&lt;TargetFramework&gt;netstandard1.6&lt;/TargetFramework&gt;\n</code></pre><p>This operation indicates that, instead of using the entire <code>netcoreapp1.0</code> framework, which includes .NET Core CLR, the .NET Core Library, and a number of other system components, our app uses only the .NET Standard Library.</p>\n</li>\n<li><p>Replace the <code>&lt;ItemGroup&gt;</code> containing package references with the following:</p>\n<pre class=\"loading\"><code class=\"lang-xml\">&lt;ItemGroup&gt;\n &lt;PackageReference Include=&quot;Microsoft.NETCore.Runtime.CoreCLR&quot; Version=&quot;1.0.2&quot; /&gt;\n &lt;PackageReference Include=&quot;Microsoft.NETCore.DotNetHostPolicy&quot; Version=&quot;1.0.1&quot; /&gt;\n&lt;/ItemGroup&gt;\n</code></pre><p>This defines the system components used by our app. The system components packaged with our app include the .NET Standard Library, the .NET Core runtime, and the .NET Core host. This produces a self-contained deployment with a smaller footprint.</p>\n</li>\n<li><p>As you did in the <a href=\"#simpleSelf\" data-linktype=\"self-bookmark\">Deploying a simple self-contained deployment</a> example, create a <code>&lt;RuntimeIdentifiers&gt;</code> element within a <code>&lt;PropertyGroup&gt;</code> in your <code>csproj</code> file that defines the platforms your app targets and specify the runtime identifier of each platform that you target. See <a href=\"../rid-catalog\" data-linktype=\"relative-path\">Runtime IDentifier catalog</a> for a list of runtime identifiers. For example, the following example indicates that the app runs on 64-bit Windows 10 operating systems and the 64-bit OS X Version 10.11 operating system.</p>\n<pre class=\"loading\"><code class=\"lang-xml\"> &lt;PropertyGroup&gt;\n   &lt;RuntimeIdentifiers&gt;win10-x64;osx.10.11-x64&lt;/RuntimeIdentifiers&gt;\n &lt;/PropertyGroup&gt;\n</code></pre><p>A complete sample <code>csproj</code> file appears later in this section.</p>\n</li>\n<li><p>Run the <code>dotnet restore</code> command to restore the dependencies specified in your project.</p>\n</li>\n<li><p>After you&#39;ve debugged and tested the program, you can create the files to be deployed with your app for each platform that it targets by using the <code>dotnet publish</code> command for both target platforms as follows:</p>\n<pre class=\"loading\"><code class=\"lang-console\">dotnet publish -c Release -r win10-x64\ndotnet publish -c Release -r osx.10.11-x64\n</code></pre><p>This creates a Release (rather than a Debug) version of your app for each target platform. The resulting files are placed in a subdirectory named <code>publish</code> that is in a subdirectory of your project&#39;s <code>.\\bin\\Release\\netstandard1.6\\&lt;runtime_identifier&gt;</code> subdirectory. Note that each subdirectory contains the complete set of files (both your app files and all .NET Core files) needed to launch your app.</p>\n</li>\n<li><p>Along with your application&#39;s files, the publishing process emits a program database (.pdb) file that contains debugging information about your app. The file is useful primarily for debugging exceptions; you can choose not to package it with your application&#39;s files.</p>\n</li>\n</ol>\n<p>The published files can be deployed in any way you&#39;d like. For example, you can package them in a zip file, use a simple <code>copy</code> command, or deploy them with any installation package of your choice. </p>\n<p>The following is the complete <code>csproj</code> file for this project:</p>\n<pre class=\"loading\"><code class=\"lang-xml\">&lt;Project Sdk=&quot;Microsoft.NET.Sdk&quot;&gt;\n  &lt;PropertyGroup&gt;\n    &lt;OutputType&gt;Exe&lt;/OutputType&gt;\n    &lt;TargetFramework&gt;netstandard1.6&lt;/TargetFramework&gt;\n    &lt;RuntimeIdentifiers&gt;win10-x64;osx.10.11-x64&lt;/RuntimeIdentifiers&gt;\n  &lt;/PropertyGroup&gt;\n  &lt;ItemGroup&gt;\n    &lt;PackageReference Include=&quot;Microsoft.NETCore.Runtime.CoreCLR&quot; Version=&quot;1.0.2&quot; /&gt;\n    &lt;PackageReference Include=&quot;Microsoft.NETCore.DotNetHostPolicy&quot; Version=&quot;1.0.1&quot; /&gt;\n  &lt;/ItemGroup&gt;\n&lt;/Project&gt;\n</code></pre></div></div>","outputRootRelativePath":"../../../","pageMetadata":"<meta name=\"author\" content=\"rpetrusha\">\r\n<meta name=\"ms.author\" content=\"ronpet\">\r\n<meta name=\"manager\" content=\"wpickett\">\r\n<meta name=\"breadcrumb_path\" content=\"toc2.json\">\r\n<meta name=\"ms.devlang\" content=\"dotnet\">\r\n<meta name=\"ms.assetid\" content=\"da7a31a0-8072-4f23-82aa-8a19184cb701\">\r\n<meta name=\"description\" content=\".NET Core Application Deployment\">\r\n<meta name=\"keywords\" content=\".NET, .NET Core, .NET Core deployment\">\r\n<meta name=\"ms.topic\" content=\"article\">\r\n<meta name=\"ms.date\" content=\"03/14/2017\">\r\n<meta name=\"ms.prod\" content=\".net-core\">\r\n<meta name=\"search.ms_sitename\" content=\"Docs\">\r\n<meta name=\"search.ms_docsetname\" content=\"docs-internal\">\r\n<meta name=\"version\" content=\"0\">\r\n<meta name=\"locale\" content=\"en-us\">\r\n<meta name=\"site_name\" content=\"Docs\">\r\n<meta name=\"search.ms_product\" content=\"MSDN\">\r\n<meta name=\"depot_name\" content=\"MSDN.docs-internal\">\r\n<meta name=\"updated_at\" content=\"2017-03-15 06:14 PM\">\r\n<meta name=\"gitcommit\" content=\"https://github.com/dotnet/docs-internal/blob/8ac95cee04f0421df906f3f24edec1eb5d47c823/docs/core/deploying/index.md\">\r\n<meta name=\"original_content_git_url\" content=\"https://github.com/dotnet/docs-internal/blob/master/docs/core/deploying/index.md\">\r\n<meta name=\"document_id\" content=\"32492038-eccd-6a60-89d6-d06c9460a367\">\r\n<meta name=\"pagetype\" content=\"Conceptual\">\r\n<meta name=\"toc_rel\" content=\"../../toc2.json\">\r\n","rawMetadata":{"author":"rpetrusha","ms.author":"ronpet","manager":"wpickett","breadcrumb_path":"/dotnet-internal/toc.json","title":".NET Core Application Deployment | Microsoft Docs","ms.devlang":"dotnet","ms.assetid":"da7a31a0-8072-4f23-82aa-8a19184cb701","description":".NET Core Application Deployment","keywords":".NET, .NET Core, .NET Core deployment","ms.topic":"article","ms.date":"03/14/2017","ms.prod":".net-core","search.ms_sitename":"Docs","search.ms_docsetname":"docs-internal","version":0,"_op_canonicalUrlPrefix":"https://docs.microsoft.com/en-us/dotnet-internal/","locale":"en-us","site_name":"Docs","search.ms_product":"MSDN","_op_openToPublicContributors":false,"depot_name":"MSDN.docs-internal","_op_gitCommitHistory":[{"author_name":"Luke Latham","author_email":"github@lukelatham.com","committer_name":"Luke Latham","comitter_email":"github@lukelatham.com","message":"Initial commit","commit_sha":"8ac95cee04f0421df906f3f24edec1eb5d47c823","commit_date":"2017-03-14 12:55:40 -0500"},{"author_name":"Luke Latham","author_email":"GuardRex@users.noreply.github.com","committer_name":"Maira Wenzel","comitter_email":"mairaw@microsoft.com","message":"Minor updates to deploying/index.md (#1715)","commit_sha":"3845ec46cbd1f65abd9b78f7b81487efed9de2f2","commit_date":"2017-03-13 00:08:34 -0700"},{"author_name":"Danielle","author_email":"dani0010@users.noreply.github.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"Update index.md","commit_sha":"71cb304c7182879d33b3f0e754c660156ee01d62","commit_date":"2017-03-11 09:38:27 -0600"},{"author_name":"John Crim","author_email":"johncrim@users.noreply.github.com","committer_name":"Maira Wenzel","comitter_email":"mairaw@microsoft.com","message":"Remove link within `code block` (#1665)","commit_sha":"5423fb1850f93343d6c644cb4c185731a33bbb99","commit_date":"2017-03-07 22:29:08 -0800"},{"author_name":"Maira Wenzel","author_email":"mairaw@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":":boom: removing preview3 folder (#1650)","commit_sha":"c2722327c3ca213309cae5e0d0417b0f0e9ea514","commit_date":"2017-03-07 03:26:34 -0800"},{"author_name":"Maira Wenzel","author_email":"mairaw@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"change version label (#1526)","commit_sha":"796df1549a7553aa93158598d62338c02d4df73e","commit_date":"2017-02-09 23:56:10 -0800"},{"author_name":"Maira Wenzel","author_email":"mairaw@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"Metadata updates (#1313)","commit_sha":"90fe68f7f3c4b46502b5d3770b1a2d57c6af748a","commit_date":"2016-12-09 12:40:41 -0800"},{"author_name":"rpetrusha","author_email":"ronpet@microsoft.com","committer_name":"rpetrusha","comitter_email":"ronpet@microsoft.com","message":"Removed references to crossgen","commit_sha":"663f4102b82512e64ab39d8046c7298a7cf37de7","commit_date":"2016-09-16 15:09:05 -0700"},{"author_name":"Zlatko Knezevic","author_email":"zlakne@microsoft.com","committer_name":"Maira Wenzel","comitter_email":"mairaw@microsoft.com","message":"Update App Types document (#823)","commit_sha":"7d5fcc7e753e28d74ef0b5bb237ed3fc26f139b6","commit_date":"2016-09-09 13:59:04 -0700"},{"author_name":"Maira Wenzel","author_email":"mairaw@microsoft.com","committer_name":"Bill Wagner","comitter_email":"wiwagn@microsoft.com","message":"Fixed typos and other small things (#883)","commit_sha":"bb15293c569fa92f1acf6315c5fe7f2cd9cb6f68","commit_date":"2016-08-08 21:27:46 -0400"},{"author_name":"rpetrusha","author_email":"ronpet@microsoft.com","committer_name":"rpetrusha","comitter_email":"ronpet@microsoft.com","message":"Final draft of revised deployment topic","commit_sha":"b35be18a525e406434e5f170815a89446ac4c6a9","commit_date":"2016-07-21 11:27:13 -0700"},{"author_name":"rpetrusha","author_email":"ronpet@microsoft.com","committer_name":"rpetrusha","comitter_email":"ronpet@microsoft.com","message":"Revised based on feedback","commit_sha":"0f836a68e75c283485c393714d40a0142c8fdfcd","commit_date":"2016-07-21 11:26:13 -0700"},{"author_name":"rpetrusha","author_email":"ronpet@microsoft.com","committer_name":"rpetrusha","comitter_email":"ronpet@microsoft.com","message":"Indented line","commit_sha":"5e1682b17332551cc55048d217f4e2ce147650b4","commit_date":"2016-07-21 11:25:16 -0700"},{"author_name":"rpetrusha","author_email":"ronpet@microsoft.com","committer_name":"rpetrusha","comitter_email":"ronpet@microsoft.com","message":"Incorporating comments from svick","commit_sha":"c1d75d7b10231e68c2a38418eb17289aaf206ca1","commit_date":"2016-07-21 11:25:16 -0700"},{"author_name":"rpetrusha","author_email":"ronpet@microsoft.com","committer_name":"rpetrusha","comitter_email":"ronpet@microsoft.com","message":"Added module app deployment, corrected information on publishing","commit_sha":"778cd87284f438d33c9dc97468cdf9cc492ab452","commit_date":"2016-07-21 11:25:16 -0700"},{"author_name":"Andrew Arnott","author_email":"andrewarnott@gmail.com","committer_name":"Maira Wenzel","comitter_email":"mairaw@microsoft.com","message":"Fix typo (#814)","commit_sha":"34cfe8918712851616a2446bb3f8bbc49f6fc304","commit_date":"2016-07-17 22:45:37 -0700"},{"author_name":"Myung Shin Kim","author_email":"options@users.noreply.github.com","committer_name":"Bill Wagner","comitter_email":"wiwagn@microsoft.com","message":"insert step 4 in \"Writing the consoling app\" section (#745)","commit_sha":"ef36fe637ba0ea026c64b650f435ce8e57646cb0","commit_date":"2016-07-07 11:40:07 -0400"},{"author_name":"Petr Onderka","author_email":"gsvick@gmail.com","committer_name":"Maira Wenzel","comitter_email":"mairaw@users.noreply.github.com","message":"Corrected titles and headings (#690)","commit_sha":"17cac6e7690fd2b08d9f5f73060056d14bca13d2","commit_date":"2016-06-28 12:36:36 -0700"},{"author_name":"Tom Dykstra","author_email":"tdykstra@microsoft.com","committer_name":"Rich Lander","comitter_email":"rlander@microsoft.com","message":"fix broken links (#651)","commit_sha":"62fdb3e60b206728d86220076867eb8fd68af82e","commit_date":"2016-06-26 10:58:55 -0700"},{"author_name":"Petr Onderka","author_email":"gsvick@gmail.com","committer_name":"Bill Wagner","comitter_email":"wiwagn@microsoft.com","message":"Fixed links (#628)","commit_sha":"e69e28b9e7400cc3dfa87faf660c3f2eab0aae90","commit_date":"2016-06-25 08:50:38 -0400"},{"author_name":"Rich Lander","author_email":"rlander@microsoft.com","committer_name":"GitHub","comitter_email":"noreply@github.com","message":"Rpetrusha appdeployment (#622)","commit_sha":"33e6c1adffd08864f04dbb1727af8121aebe7d83","commit_date":"2016-06-24 17:18:10 -0700"},{"author_name":"Tom Dykstra","author_email":"tdykstra@microsoft.com","committer_name":"Bill Wagner","comitter_email":"wiwagn@microsoft.com","message":"fix deploy docs in toc (#611)","commit_sha":"8dd5a417620bb943f3378813583f7dab41d25dbd","commit_date":"2016-06-24 15:51:27 -0400"}],"updated_at":"2017-03-15 06:14 PM","_op_gitContributorInformation":{"author":{"profile_url":"https://github.com/rpetrusha","display_name":"rpetrusha","id":"10886961"},"contributors":[{"profile_url":"https://github.com/rpetrusha","display_name":"rpetrusha"},{"profile_url":"https://github.com/GuardRex","display_name":"Luke Latham","id":"1622880"},{"profile_url":"https://github.com/dani0010","display_name":"Danielle","id":"8279113"},{"profile_url":"https://github.com/johncrim","display_name":"John Crim","id":"3312127"},{"profile_url":"https://github.com/mairaw","display_name":"Maira Wenzel","id":"12971179"},{"profile_url":"https://github.com/blackdwarf","display_name":"blackdwarf","id":"3115004"},{"profile_url":"https://github.com/AArnott","display_name":"Andrew Arnott","id":"3548"},{"profile_url":"https://github.com/options","display_name":"Myung Shin Kim","id":"1495689"},{"profile_url":"https://github.com/svick","display_name":"Petr Onderka","id":"287848"},{"profile_url":"https://github.com/tdykstra","display_name":"Tom Dykstra","id":"1569635"},{"profile_url":"https://github.com/richlander","display_name":"Rich Lander","id":"2608468"}],"update_at":"3/15/2017"},"gitcommit":"https://github.com/dotnet/docs-internal/blob/8ac95cee04f0421df906f3f24edec1eb5d47c823/docs/core/deploying/index.md","original_content_git_url":"https://github.com/dotnet/docs-internal/blob/master/docs/core/deploying/index.md","open_to_public_contributors":false,"content_git_url":"https://github.com/dotnet/docs/blob/master/docs/core/deploying/index.md","document_id":"32492038-eccd-6a60-89d6-d06c9460a367","layout":"Conceptual","pagetype":"Conceptual","canonical_url":"https://docs.microsoft.com/en-us/dotnet-all/articles/core/deploying/index","toc_asset_id":"articles/toc.json","toc_rel":"../../toc.json","_op_ogTitle":".NET Core Application Deployment","_op_displayDate":"2017-3-14","_op_displayDate_source":"2017-03-14T00:00:00Z","_op_wordCount":2553,"_op_rawTitle":"<h1 id=\"net-core-application-deployment\" sourcefile=\"docs/core/deploying/index.md\" sourcestartlinenumber=\"14\" sourceendlinenumber=\"14\">.NET Core Application Deployment</h1>","_op_searchScope":[".NET"],"_op_canonicalUrl":"https://docs.microsoft.com/en-us/dotnet-all/articles/core/deploying/index","fileRelativePath":"articles/core/deploying/index.html"},"themesRelativePathToOutputRoot":"_themes/"}